{
    "news_titles": [
        "Ron DeSantis ends 2024 campaign, endorses Trump over Haley as New Hampshire vote looms",
        "Top 5 things to watch in markets in the week ahead",
        "This week in EVs: Musk's AI Ultimatum | Pro Recap",
        "Shiba Inu (SHIB) Becoming Bullish, Ethereum (ETH) Price Screams Rally Continuation, Bitcoin (BTC) Not Giving up Market Dominance\nBy U.Today - 14 minutes ago U.Today - Shiba Inu currently displays an ascending triangle pattern on the SHIB/USDT chart. This technical formation is widely recognized and could be a signal to a significant...",
        "Bitcoin struggles to hold $40k support level after ETF-induced rally fades\nBy Investing.com - 3 hours ago The cryptocurrency Bitcoin is facing a challenging period as it strives to maintain stability above the critical $40,000 support level. After a surge in value following the...",
        "Ethereum faces scalability hurdles as high fees challenge dApp adoption\nBy Investing.com - 4 hours ago LONDON - The leading smart contract platform Ethereum is currently grappling with significant scalability issues, as highlighted by Crypto Rand, a respected voice in the...",
        "FXDD Integrates Autochartist to Increase Trading Efficiency\nBy Investing.com Studios Forex industry pioneer FXDD and leading market analysis provider Autochartist team up to amplify trading performance.",
        "Coinbase likely to win SEC lawsuit on unregistered securities\nBy Investing.com - 4 hours ago NEW YORK - Analysts are anticipating a positive outcome for Coinbase (NASDAQ:COIN) in its legal battle with the Securities and Exchange Commission (SEC) over allegations that it...",
        "Dogecoin market cap hits $12 billion amid X Payments speculation\nBy Investing.com - 5 hours ago Cryptocurrency Dogecoin (DOGE) has witnessed a notable surge in value, with its market capitalization soaring to an estimated $12 billion today. The uptick is largely driven by the...",
        "Max Keiser Explains Why BTC Failed to Hit $50,000 Despite ETF Being Nailed, Shibarium Sees 210% Transaction Spike, Ripple CEO Slams SEC Chair: Crypto News Digest by U.Today\nBy U.Today - 6 hours ago U.Today - Take a look at what's happening in the world of crypto by reading U.Today's top three news stories.\nKey reason why Bitcoin failed to reach $50,000 despite ETF being...",
        "Bitcoin ETFs See $10 Billion Traded in Just Three Days, Ripple and Hedera Leaders Meet for Groundbreaking Chat, Robinhood Adds Billions in SHIB: Crypto News Digest by U.Today\nBy U.Today - 6 hours ago U.Today - Don't miss anything happening in the world of crypto with U.Today's top three news stories over the past day.\nBitcoin ETF: $10 billion traded in just three daysIn an...",
        "Ripple's Top Lawyer Calls SEC \"Broken Regulator,\" Tron Founder Withdraws Billions of SHIB From Binance, Samson Mow Slams JP Morgan CEO: Crypto News Digest by U.Today\nBy U.Today - 6 hours ago U.Today - Read U.Today's top three news stories to learn what's happening in the world of crypto.\nTop Ripple lawyer says Coinbase (NASDAQ:COIN) is fighting against “broken...",
        "Bitcoin Price Action Explained: Here's Real Reason Why BTC Dipped After ETF Approval\nBy U.Today - 6 hours ago U.Today - 2024 has already proven to be a wild trip for Bitcoin investors. In what was likely the most exciting financial product launch in history, the SEC approved 10 spot...",
        "ETH ETF Next? Seasoned VC Vance Spencer Shares His Views\nBy U.Today - 7 hours ago U.Today - As the new bull market is gaining traction, Netflix (NASDAQ:NFLX) alum and seasoned crypto VC Vance Spencer indicates a number of milestones the blockchain segment could...",
        "BlackRock's Updated Bitcoin (BTC) Holdings Uncovered, Hold on Tight\nBy U.Today - 7 hours ago U.Today - In a stunning revelation, BlackRock (NYSE:BLK), the world's largest hedge fund, has rapidly amassed an impressive 16,361 BTC for its recently listed spot Bitcoin ETF. The...",
        "Binance Issues Important Notice for BTC, XRP, ADA Futures Traders: Details\nBy U.Today - 7 hours ago U.Today - Binance, the world's largest cryptocurrency exchange by trading volume, has issued an important notice for futures traders.\nThe crypto exchange reports incidents wherein...",
        "Bitcoin Might Explode as Weekly Golden Cross Forms: Details\nBy U.Today - 7 hours ago U.Today - The largest cryptocurrency by market value, Bitcoin (BTC), has confirmed a bullish signal on its weekly chart.\nBitcoin's weekly simple moving average (SMA) 50 has crossed...",
        "Ethereum (ETH) Staking Ratio Surprisingly Keeps Surging Despite Shapella\nBy U.Today - 7 hours ago U.Today - Ki Young Ju, founder and CEO of CryptoQuant, leading on-chain analytical firm, shared his views on the Ethereum (ETH) staking progress. He admits he was wrong about...",
        "Most of Approved Spot Bitcoin ETFs Will Not Make It: Grayscale CEO\nBy U.Today - 7 hours ago\n1\n U.Today - According to a recent CNBC report, during the annual World Economic Forum event in Davos, the boss of Grayscale Michael Sonnenshein spoke about the future of spot Bitcoin...",
        "BlackRock to Become BTC Biggest Holder, Analyst Predicts; Michael Saylor Issues Warning for BTC Holders; SHIB Rep Unveils Shibarium's Future: Crypto News Digest by U.Today\nBy U.Today - 8 hours ago U.Today - U.Today has prepared a summary of the top three news stories over the weekend.\nBlackRock (NYSE:BLK) to become Bitcoin's biggest holder, top analyst predictsEric...",
        "Bitcoin Rally Ahead? Here's Estimated BTC Halving Date, According to Glassnode\nBy U.Today - 9 hours ago U.Today - As Bitcoin (BTC) enthusiasts eagerly await the next halving event, analytics firm Glassnode has provided an estimate for the Bitcoin halving date, sending ripples of...",
        "Legendary Trader Peter Brandt: Bitcoin 'Best Store of Value'\nBy U.Today - 9 hours ago U.Today - Legendary trader Peter Brandt recently sparked discussions around Bitcoin's role as a store of value. Amid economic uncertainties and the diminishing purchasing power of...",
        "Major 'Secret' of MicroStrategy Revealed by Bitcoiner Samson Mow\nBy U.Today - 10 hours ago U.Today - Samson Mow, major Bitcoin evangelist and boss of the Bitcoin-oriented company Jan3 that intends to help nation-states with Bitcoin adoption, has published a Twitter/X...",
        "$1 Million-per-Bitcoin (BTC) Advocate Samson Mow Slams JP Morgan CEO\nBy U.Today - 10 hours ago U.Today - In a recent interview, JPMorgan CEO Jamie Dimon cautioned against involvement with Bitcoin, labeling the largest cryptocurrency as a tool primarily used for fraud and...",
        "Here's Who Burned 9,001 ETH in Last 30 Days\nBy U.Today - 11 hours ago U.Today - Uniswap, the world’s largest decentralized exchange, is apparently a top burner of Ethereum, with a staggering 9,001 ETH incinerated from the circulating supply in...",
        "Edward Snowden Shocked at Jamie Dimon's New Bitcoin Criticism Level\nBy U.Today - 11 hours ago\n1\n U.Today - Famous U.S. whistleblower Edward Snowden has taken to the X/Twitter platform to direct a bit of a critique at JP Morgan chief executive officer Jamie Dimon over his...",
        "XRP, BTC, ETH Show Surprising Profitability Trend, Biggest Signal to Watch\nBy U.Today - 11 hours ago U.Today - According to on-chain analytics firm Santiment, major cryptocurrencies Bitcoin, Ethereum and XRP are displaying an intriguing profitability trend.\nIn a new tweet,...",
        "Elon Musk Surprisingly Reacts to Bitcoin's Epic Surge\nBy U.Today - 11 hours ago\n2\n U.Today - In a significant development for the cryptocurrency market, Yassine Elmandjra, Director of Digital Assets at ARK Invest, recently disclosed that Bitcoin's hash rate has...",
        "Legendary Trader Peter Brandt Spotlights Intriguing Formation on Bitcoin Chart\nBy U.Today - 11 hours ago U.Today - In a new tweet, legendary trader Peter Brandt highlights an intriguing trend on the Bitcoin price chart, saying that his attention has been drawn to a series of higher...",
        "Vitalik Buterin Shares New Ethereum Vision\nBy U.Today - 12 hours ago U.Today - Vitalik Buterin has voiced a new vision for the Ethereum platform that seeks to address its most pressing challenges and leverage emerging technologies to reinvent...",
        "Ethereum (ETH) Surpassed Bitcoin (BTC) for Second Time Ever\nBy U.Today - 12 hours ago U.Today - Ethereum's long-term holders have overtaken Bitcoin's, marking only the second occurrence of such an event. The value's growth confirms a relevant market thesis: Ethereum...",
        "Ethereum (ETH) Layer 2 Networks Growth Is Crucial: Here's Why\nBy U.Today - 12 hours ago U.Today - With Ethereum transaction activities increasingly shifting to Layer 2 (L2) networks, the ecosystem is bracing for a potential new bull run, one that could be...",
        "Can Solana (SOL) Continue Its Path Up in 2024?\nBy U.Today - 12 hours ago U.Today - As we traverse into 2024, the trajectory of Solana becomes a pivotal question for the cryptocurrency market. A glance at the Solana chart reveals strong growth, followed...",
        "Top Cryptocurrencies to Watch in 2024\nBy U.Today - 12 hours ago U.Today - In this guide, we are going to discuss some large-cap cryptocurrencies that might be worth the attention of newbies and pro investors. As the crypto segment is gaining...",
        "Ethereum (ETH) Has to Break This Major Resistance Ahead of $2,500\nBy U.Today - 12 hours ago U.Today - Ethereum is showing a steady performance on the market, approaching a critical resistance level at $2,400. Breaking this resistance level should push the asset closer to...",
        "Ethereum's Vitalik Buterin Shuffles USDC Funds, Likely Reason\nBy U.Today - 12 hours ago U.Today - Vitalik Buterin, the cofounder of Ethereum, the second-largest cryptocurrency by market capitalization, has recently made a significant transfer of USD Coin (USDC), a...",
        "Whales Buying Ethereum (ETH) and Bitcoin (BTC) Dump\nBy U.Today - 12 hours ago\n1\n U.Today - A recent plummet in the value of Bitcoin (BTC) and Ethereum (ETH) has caught the attention of whales who were looking for good entries. Notably, two whale wallets have...",
        "Ethereum L2s Surpassed All Other Blockchains by TVL: Details\nBy U.Today - 12 hours ago U.Today - Ethereum Foundation contributor Josh Stark noticed a major achievement for Ethereum-based ecosystem of second-layer networks. In 2021, 20% of his followers were sure that...",
        "XRP Saw Biggest Price Drop Since August: Here's What Happened\nBy U.Today - 12 hours ago U.Today - XRP has recently experienced a seismic price drop, one we have not seen since August. A massive price wick, as shown on the chart, liquidated millions of dollars worth of...",
        "Ron DeSantis ends 2024 campaign, endorses Trump over Haley as New...\nBy Reuters - Jan 21, 2024\n43",
        "Top 5 things to watch in markets in the week ahead\nBy Investing.com - Jan 21, 2024\n7",
        "This week in EVs: Musk's AI Ultimatum | Pro Recap\nBy Investing.com - Jan 21, 2024\n2",
        "5 big analyst AI moves: Apple and IBM upgraded, Baidu 'best AI play in...\nBy Investing.com - Jan 21, 2024",
        "Hundreds of thousands demonstrate against right-wing extremism in...\nBy Reuters - Jan 21, 2024\n9",
        "1 Stock to Buy, 1 Stock to Sell This Week: Netflix, Tesla\nBy Jesse Cohen - Jan 21, 2024\n20",
        "Alibaba, PayPal Have Lost 80% Since 2021: Falling Knives or...\nBy Francesco Casarella - Jan 19, 2024\n9",
        "Street Calls of the Week: An Apple a Day...\nBy Garrett Cook - Jan 21, 2024\n1",
        "S&P 500 Set to Break Out, Russell 2000 Could Follow Suit; Nasdaq Still...\nBy Declan Fallon - Jan 19, 2024\n7",
        "‘FAAMG’ Earnings Set to Impress, but Stretched Valuations Pose Big...\nBy Jesse Cohen - Jan 19, 2024\n11"
    ]
}