{
    "news_info": [
        {
            "title": "Ripple Shares Big Update on XRP Ethereum Sidechain Launch",
            "time": "- 21 minutes ago"
        },
        {
            "title": "Ark's Cathie Wood Touts Bitcoin (BTC) as World's Most Secure Asset: Details",
            "time": "- 21 minutes ago"
        },
        {
            "title": "Fidelity's Jurrien Timmer Makes Important Bitcoin (BTC) Statement",
            "time": "- 21 minutes ago"
        },
        {
            "title": "FXDD Integrates Autochartist to Increase Trading Efficiency",
            "time": "- 51 minutes ago"
        },
        {
            "title": "Ethereum (ETH) Faces Serious Bug; Here's Who Might Be Affected",
            "time": "- 51 minutes ago"
        },
        {
            "title": "Is Bitcoin Creator Satoshi Nakamoto Back? Enigmatic Post Sparks Speculation",
            "time": "- 1 hour ago"
        },
        {
            "title": "Self-Proclaimed Satoshi Craig Wright Takes Dig at Ethereum's Vitalik Buterin",
            "time": "- 1 hour ago"
        },
        {
            "title": "Coinbase CEO Reacts to Ethereum Staking Major Issue: Details",
            "time": "- 2 hours ago"
        },
        {
            "title": "Max Keiser Expects XRP to Crash to $0.01",
            "time": "- 2 hours ago"
        },
        {
            "title": "Arthur Hayes Predicts Crucial Bitcoin (BTC) Bottom to Watch",
            "time": "- 2 hours ago"
        },
        {
            "title": "Massive 200,000 Bitcoin (BTC) Dump Expected in 60 Days: Mt. Gox Update",
            "time": "- 4 hours ago"
        },
        {
            "title": "Chainlink Automation joins Coinbase's Base L2 to cut developer costs",
            "time": "- 5 hours ago"
        },
        {
            "title": "SEC seeks financial records and sales details from Ripple Labs",
            "time": "- 6 hours ago"
        },
        {
            "title": "Shiba Inu (SHIB) Rapidly Breaks Down, Ethereum (ETH) Loses Traction, While Solana (SOL) Presents Hidden Opportunity",
            "time": "- 6 hours ago"
        },
        {
            "title": "Crucial Bitcoin (BTC) Resistance Is Hit, Will Shiba Inu (SHIB) Gain or Lose Zero? Cardano (ADA) in Trouble",
            "time": "- 7 hours ago"
        },
        {
            "title": "Shiba Inu maintains market cap above $5 billion as meme coins attract investors",
            "time": "- 7 hours ago"
        },
        {
            "title": "XRP's Epic Battle Against Bears, Solana Breaks $100, While Ethereum Fights for Momentum",
            "time": "- 9 hours ago"
        },
        {
            "title": "Ethereum (ETH) In Dangerous Position, Bitcoin (BTC) About to Lose $40,000, Shiba Inu (SHIB) At Local Support",
            "time": "- 9 hours ago"
        },
        {
            "title": "XRP Is Surprisingly Stable, Here's Why",
            "time": "- 10 hours ago"
        },
        {
            "title": "Bitcoin down 20% from post-ETF highs",
            "time": "- 10 hours ago"
        },
        {
            "title": "Shiba Inu (SHIB) Becoming Bullish, Ethereum (ETH) Price Screams Rally Continuation, Bitcoin (BTC) Not Giving up Market Dominance",
            "time": "- 14 hours ago"
        },
        {
            "title": "Bitcoin advocate Samson Mow dismisses $30,000 price drop fears",
            "time": "- 14 hours ago"
        },
        {
            "title": "Dogecoin Founder Issues Bitcoin Statement on Further BTC Decline",
            "time": "- 15 hours ago"
        },
        {
            "title": "Core Scientific emerges from bankruptcy, set to resume Nasdaq trading",
            "time": "- 16 hours ago"
        },
        {
            "title": "Max Keiser Explains Why BTC Failed to Hit $50,000 Despite ETF Being Nailed, Shibarium Sees 210% Transaction Spike, Ripple CEO Slams SEC Chair: Crypto News Digest by U.Today",
            "time": "- 16 hours ago"
        },
        {
            "title": "Bitcoin ETFs See $10 Billion Traded in Just Three Days, Ripple and Hedera Leaders Meet for Groundbreaking Chat, Robinhood Adds Billions in SHIB: Crypto News Digest by U.Today",
            "time": "- 16 hours ago"
        },
        {
            "title": "Ripple's Top Lawyer Calls SEC \"Broken Regulator,\" Tron Founder Withdraws Billions of SHIB From Binance, Samson Mow Slams JP Morgan CEO: Crypto News Digest by U.Today",
            "time": "- 16 hours ago"
        },
        {
            "title": "Bitcoin Price Action Explained: Here's Real Reason Why BTC Dipped After ETF Approval",
            "time": "- 17 hours ago"
        },
        {
            "title": "ETH ETF Next? Seasoned VC Vance Spencer Shares His Views",
            "time": "- 17 hours ago"
        },
        {
            "title": "Ethereum (ETH) Staking Ratio Surprisingly Keeps Surging Despite Shapella",
            "time": "- 17 hours ago"
        },
        {
            "title": "BlackRock's Updated Bitcoin (BTC) Holdings Uncovered, Hold on Tight",
            "time": "- 17 hours ago"
        },
        {
            "title": "Binance Issues Important Notice for BTC, XRP, ADA Futures Traders: Details",
            "time": "- 17 hours ago"
        },
        {
            "title": "Bitcoin Might Explode as Weekly Golden Cross Forms: Details",
            "time": "- 17 hours ago"
        },
        {
            "title": "Most of Approved Spot Bitcoin ETFs Will Not Make It: Grayscale CEO",
            "time": "- 17 hours ago"
        },
        {
            "title": "XRP to Crash to Virtual Zero Against Bitcoin, Predicts Max Keiser",
            "time": "- 17 hours ago"
        },
        {
            "title": "BlackRock to Become BTC Biggest Holder, Analyst Predicts; Michael Saylor Issues Warning for BTC Holders; SHIB Rep Unveils Shibarium's Future: Crypto News Digest by U.Today",
            "time": "- 18 hours ago"
        },
        {
            "title": "Bitcoin ETFs draw $4.1 billion since recent Wall Street debut",
            "time": "- 19 hours ago"
        },
        {
            "title": "Major 'Secret' of MicroStrategy Revealed by Bitcoiner Samson Mow",
            "time": "- 20 hours ago"
        },
        {
            "title": "FXDD Integrates Autochartist to Increase Trading Efficiency",
            "time": "- 20 hours ago"
        },
        {
            "title": "$1 Million-per-Bitcoin (BTC) Advocate Samson Mow Slams JP Morgan CEO",
            "time": "- 20 hours ago"
        },
        {
            "title": "Bitcoin Rally Ahead? Here's Estimated BTC Halving Date, According to Glassnode",
            "time": "- 20 hours ago"
        },
        {
            "title": "Legendary Trader Peter Brandt: Bitcoin 'Best Store of Value'",
            "time": "- 20 hours ago"
        },
        {
            "title": "Peter Schiff Reacts to Bitcoin Price as Hourly Liquidation Tops $100 Million in Crypto Bloodbath",
            "time": "- 20 hours ago"
        },
        {
            "title": "Mt. Gox begins verifying addresses for Bitcoin repayments",
            "time": "- 21 hours ago"
        },
        {
            "title": "Bitcoin ETFs gain traction as Grayscale sells holdings post-SEC approval",
            "time": "- 21 hours ago"
        },
        {
            "title": "Grayscale Destroyed Bullish Crypto Momentum, But Not for Long",
            "time": "- 21 hours ago"
        },
        {
            "title": "Here's Who Burned 9,001 ETH in Last 30 Days",
            "time": "- 21 hours ago"
        },
        {
            "title": "Edward Snowden Shocked at Jamie Dimon's New Bitcoin Criticism Level",
            "time": "- 21 hours ago"
        },
        {
            "title": "Elon Musk Surprisingly Reacts to Bitcoin's Epic Surge",
            "time": "- 21 hours ago"
        },
        {
            "title": "3 Reasons Why Bitcoin (BTC) Might Fall to $35,000, And It's Okay",
            "time": "- 22 hours ago"
        },
        {
            "title": "European firms cut fees on Bitcoin ETPs ahead of April's halving event",
            "time": "- 22 hours ago"
        },
        {
            "title": "Cryptoverse: Will bitcoin behave better on Wall Street?",
            "time": "- 22 hours ago"
        }
    ]
}