{
    "news_info": [
        {
            "title": "Max Keiser Expects XRP to Crash to $0.01",
            "time": "- 18 hours ago",
            "content": "Max Keiser Expects XRP to Crash to $0.01\n\n\n\n\n \n\n\n\n\n\nXRP/USD\n-0.89%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nU.Today - Vocal Bitcoin proponent Max Keiser, who is known for his severe criticism of altcoins, has taken to the Twitter/X social media platform to take a jab at XRP and predict an approaching price collapse of the fifth largest cryptocurrency in terms of the market capitalization value.\nOver the past few months, Keiser made a similar ultra-bearish prediction about Solana (SOL), also expecting its price to crash. It happened at the very start of January, when SOL faced a 15% drop, falling from $110 to $96 quickly.\nMax Keiser bashes XRPBeing a hardcore Bitcoiner, Keiser believes all the other cryptocurrencies in the market to be centralized and expects them to crash against Bitcoin, as well as gold, silver, U.S. dollar and all other assets in the future.This time, he published a tweet, calling XRP “centralized garbage” and stating that it is “going to $0.01.”\nIn the summer of 2023, Keiser commented on a tweet published by Ripple supporter and advocate John Deaton, founder of CryptoLaw U.S. Deaton’s tweet was about Bitcoin maximalists and the SEC, the Securities and Exchange Commission of the U.S., which started a long-running legal process against Ripple Labs in late 2020, claiming XRP to be an unregistered security.\nXRP going downKeiser then again stated that XRP is too centralized, and the fact of the SEC suing Ripple was proof of that. Bitcoin, as Keiser pointed out, was completely and “uniquely” out of regulators’ reach.In his other tweets, Keiser often slams ADA, XRP, SOL and other top cryptocurrencies as securities and founders of Cardano and Solana as scammers.\nSince Thursday last week, the Ripple-affiliated cryptocurrency XRP has declined by more than 11%, following Bitcoin, which also crashed on the same day. It first surged on the news of spot Bitcoin ETFs approval by the SEC, along with the rest of the crypto market, but then Bitcoin began a large decline and so did ETH, XRP, SOL, SHIB and other top cryptocurrencies.\nOn Friday, XRP saw three consecutive red candles, pushing it nearly 5% down to $0.52288. By now, however, the coin has made a slight recovery, changing hands at $0.54583.\nKeiser has been recently tweeting about Bitcoin that the $220,000 scenario he had predicted earlier is “still in play.”\nThis article was originally published on U.Today"
        },
        {
            "title": "Massive 200,000 Bitcoin (BTC) Dump Expected in 60 Days: Mt. Gox Update",
            "time": "- 18 hours ago",
            "content": "© Reuters. Massive 200,000 Bitcoin (BTC) Dump Expected in 60 Days: Mt. Gox Update\n\n\n\n\n \n\n\n\n\n\nBTC/USD\n-0.77%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nBCH/USD\n-2.72%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nU.Today - Colin Wu, a prominent figure in the crypto journalism space, has reported that Mt. Gox recently initiated an email verification process for users, seeking confirmation of ownership for exchange address accounts designated as payment addresses for Bitcoin (BTC) and Bitcoin Cash (BCH). \nThis move follows December 2023 reports from creditors who confirmed receiving compensation in Japanese yen through their PayPal (NASDAQ:PYPL) accounts, with the ongoing repayments scheduled to extend into 2024.\nThe central concern emerging from this development is the significant volume of Bitcoin that Mt. Gox is rumored to be releasing onto the market. While estimates vary, ranging from 142,000 BTC to 200,000 BTC, the lack of consensus among sources has prompted increased scrutiny within the crypto community. Market participants are particularly attentive as the countdown begins for a potential 200,000 BTC release within the next 60 days.\nComplicating matters, Mt. Gox presently holds 143,000 BCH, intensifying speculation about the combined impact of the Bitcoin and Bitcoin Cash release on market dynamics. With an additional 69 billion yen reportedly under the exchange's control, the situation has garnered attention for its potential to influence broader market sentiment.\nAs the industry closely monitors this unfolding scenario, analysts and enthusiasts are awaiting further details and confirmation from Mt. Gox. The reserved anticipation within the community underscores the significance of this story, making it a focal point for careful observation in the weeks ahead.\nThis article was originally published on U.Today"
        },
        {
            "title": "Arthur Hayes Predicts Crucial Bitcoin (BTC) Bottom to Watch",
            "time": "- 18 hours ago",
            "content": "© Reuters Arthur Hayes Predicts Crucial Bitcoin (BTC) Bottom to Watch\n\n\n\n\n \n\n\n\n\n\nBTC/USD\n-0.77%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nU.Today - BitMEX cofounder and former CEO Arthur Hayes has shared a major Bitcoin (BTC) price forecast that puts an end to speculation surrounding when the coin will test its bottom. \nExpected Bitcoin price floorSharing his insights in a new Substack post, Arthur Hayes drew inferences using the state of the global economy to note how susceptible the abated inflationary pressures are to returning in no time.Drawing on this, he forecasts a 30% correction from the spot Bitcoin Exchange Traded Fund (ETF) high of $48,000. If this projection comes to pass, then he foresees Bitcoin dropping to the $30,000 and $35,000 price range.\nBitcoin has been in a freefall since the United States Securities and Exchange Commission (SEC) greenlighted the 11 spot BTC ETFs that now trade in the market. At the time of writing, Bitcoin has dropped by a milder 0.64% in the past 24 hours to $40,042.44. This is an impressive figure that shows recovery, seeing as the coin fell as low as $39,105.51 in the past 24 hours.\nKnown for his big bold predictions, Arthur Hayes believes there might be some forms of relief introduced by the Federal Reserve to support growth; nonetheless, he is convinced crypto is primed to play a key role as a hedge against inflation as mainstream banks are on the verge of collapsing.\nBeyond Bitcoin, Hayes’ altcoin backupWith a clear conviction of where Bitcoin might fall to before rebounding on a worst-case basis, Arthur Hayes confirmed that he has currently sold off his position in Solana (SOL) and BONK at a slight loss.Hayes is a big promoter of the Solana ecosystem, and the sell-off showcases that more of a downward spiral might still be underway for this asset that has lost 12.3% of its value in the past week amid an intense sell-off.\nHayes, however, noted that should Bitcoin fall below $35,000, he will begin to load up on Dogwifhat (WIF), attesting to the potential of the meme coin to outperform when the market finally enters the recovery phase.\nThis article was originally published on U.Today"
        },
        {
            "title": "Jim Cramer Might Be Behind Bitcoin's Latest Correction, Here's How",
            "time": "- 18 hours ago",
            "content": "© Reuters. Jim Cramer Might Be Behind Bitcoin's Latest Correction, Here's How\n\n\n\n\n \n\n\n\n\n\nBTC/USD\n-0.77%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nU.Today - The price of Bitcoin (BTC) is far from the release of the market bears as the top digital currency dropped below the psychologically important level of $40,000. At the time of writing, the coin is priced at $39,968.21, despite being up by 0.95% in the past 24 hours. The cryptocurrency has notably been flirting with the $40,000 level, with volatility that has cast doubt on what’s next for the top coin.\nWith all eyes on Bitcoin, the latest correction might be a result of the Jim Cramer effect. Based on precedent, crypto proponents on X have identified a pattern that sees Bitcoin move in the opposite direction from what Jim Cramer identifies. As the CNBC Mad Money Host noted on X on Jan. 24, he pointed out that Bitcoin was off to a strong start in defiance of his earlier call that the coin’s floor might still be far away.\nWhen this statement was made, Bitcoin was trading at about the $40,000 price mark, and its correction at the time of writing suggests the Jim Cramer theory might be accurate after all. \nBitcoin's potential bullish resurgenceBitcoin has been underperforming in the year-to-date (YTD) period, with price data showing it has slumped by 5.31%, touching a low of $38,521.89 over the past month.The launched spot Bitcoin Exchange Traded Fund (ETF) product has not produced enough impact, as projected by top market veterans like Samson Mow. While there is enough time to hit the $1 million price projection from Mow, Bitcoin’s outlook since the product started trading has been relatively gloomy.\nWith the Bitcoin halving event now ahead, the market is choosing to lean on another network fundamental to anticipate a massive bullish resurgence in the price of the digital currency. According to top analysts like Benjamin Cowen, BTC is poised to enter the bull market ahead of the forthcoming halving.\nThis article was originally published on U.Today"
        },
        {
            "title": "Shiba Inu (SHIB) Rapidly Breaks Down, Ethereum (ETH) Loses Traction, While Solana (SOL) Presents Hidden Opportunity",
            "time": "- 22 hours ago",
            "content": "© Reuters Shiba Inu (SHIB) Rapidly Breaks Down, Ethereum (ETH) Loses Traction, While Solana (SOL) Presents Hidden Opportunity\n\n\nU.Today - Shiba Inu has experienced a significant breakdown from its recent consolidation phase. The chart depicts a clear downward trajectory as SHIB failed to maintain its position within the ascending triangle pattern it had formed over the past few months.\nThe breakdown was signaled as SHIB prices breached the key support level at $0.000009, which had previously acted as a reliable floor for the price during consolidation phases. Following this, SHIB prices tumbled further, slicing through subsequent support near $0.0000087. This price action marked a decisive shift in market sentiment from accumulation to distribution.\nSHIB/USDT Chart by TradingViewThe next support level to watch is at $0.0000082, where SHIB may find a temporary reprieve from the selling pressure. If this level fails to hold, the next critical support lies at $0.0000076, which could serve as the last line of defense before a more significant drop.\nFor a reversal to occur and for SHIB to regain its upward momentum, it would need to reclaim previous support levels and transform them back into supports. This would require a substantial influx of buying pressure, potentially sparked by positive developments within the Shiba Inu ecosystem or broader cryptocurrency market rallies.\nThe first sign of a possible reversal would be a return above $0.0000087, followed by a sustained move above the $0.000009 price level. A breakout above these levels, accompanied by increasing volume, could indicate that the downtrend is losing steam and that bulls are regaining control.\nSolana paints reversal patternSolana has been developing a subtle yet potentially pivotal chart pattern. The asset has been tracing a slow and steady ascending channel, a formation that suggests a controlled and consistent uptrend. This pattern, characterized by higher lows and higher highs contained within two parallel trendlines, speaks to potential for continued growth.The significance of this pattern lies in the momentum it could provide for SOL. Should the price action remain strong within the upper half of the channel, and particularly if it challenges the upper trendline, we could see Solana break through and embark on a more aggressive rally. \nSuch a bullish scenario would likely be supported by increased trading volume and positive developments within the Solana ecosystem, such as new project launches or updates that enhance network performance.\nThe immediate local resistance stands at around $55, and a confident push beyond this could confirm bullish sentiment. Inversely, if Solana's price dips below the channel's lower boundary, around $48, it could indicate that a bearish narrative is taking hold.\nEthereum momentum decreasingEthereum is exhibiting signs of waning momentum, as observed in recent price movements. The asset, which has long been considered the backbone of the decentralized finance sector, is facing a pivotal moment that could determine its trajectory for the coming weeks.The provided chart illustrates Ethereum's struggle to maintain its grasp on the market. The price has been on a downward trend, edging closer to the local 26-day Exponential Moving Average. This level, currently near $2,465, is critical; if Ethereum fails to hold this line, we might see it descend to test the more significant 50 EMA, which stands around the $2,300 mark.\nThe 26 EMA serves as a short-term sentiment gauge, and its breach could signal a lack of immediate bullish support. Should this level fail to act as a springboard for price recovery, Ethereum's next stop could indeed be the 50 EMA. A breach below this longer-term moving average could potentially open the gates for a test of lower support levels, highlighting the need for investors to brace for more volatility.\nMarket participants are now recalibrating their expectations, understanding that the road to sustainable gains is a long-term journey.\nThis article was originally published on U.Today"
        },
        {
            "title": "XRP's Epic Battle Against Bears, Solana Breaks $100, While Ethereum Fights for Momentum",
            "time": "- 23 hours ago",
            "content": "XRP's Epic Battle Against Bears, Solana Breaks $100, While Ethereum Fights for Momentum\n\n\n\n\n \n\n\n\n\n\nXRP/USD\n-0.94%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nETH/USD\n-1.01%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nSOL/USD\n+1.16%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nU.Today - XRP is currently locked in a fierce struggle with bearish forces. The digital asset, which operates within the Ripple network, is experiencing difficulty establishing a position above a critical technical indicator — the 200-day Exponential Moving Average (EMA).\nThe 200 EMA serves as an important barometer for the long-term trend and investor sentiment. For XRP, remaining below this level suggests that the asset lacks the bullish momentum needed to shift into an upward trajectory. This inability to secure a foothold above the 200 EMA raises questions about the stability of positive price action in the near term.\nXRP/USDT Chart by TradingViewTechnical analysis shows that the 200 EMA is a dynamic level of resistance that many traders watch closely. A consistent failure to breach this mark can lead to a self-fulfilling prophecy where the resistance level grows stronger, as more traders set their sell orders around this key price point. \nEthereum keeps on struggling Ethereum is showing signs of losing its upward momentum, failing to form a higher high — an indicator that market experts often interpret as a sign of an impending price correction.The ETH chart reveals a telling pattern; the absence of a new higher high is significant. Typically, in a bullish market phase, the price of an asset creates a series of higher highs and higher lows. However, Ethereum's inability to push beyond its recent peak may suggest that the bulls are running out of steam and a reevaluation of market sentiment could be underway.\nAnalyzing the chart, the local resistance level has been a tough ceiling for Ethereum to break. This resistance, where sell orders tend to cluster, is acting as a barrier preventing further upward movement. On the flip side, the support level represents a price point with a concentration of buy orders, offering a potential cushion against a price drop. If Ethereum fails to uphold the support level, it could trigger a price breakdown, signaling a shift to a bearish trend.\nIf Ethereum's price continues to struggle, the scenario could unfold where the asset drops further, testing subsequent support levels. While the underlying fundamentals of Ethereum, such as network upgrades and adoption rates, remain robust, the short-term price action could still be subject to corrective forces.\nSolana wants another roundThe battleground of volatility on the crypto market continues, and Solana (SOL) has not been spared from its whims. Once a darling of the crypto world for its speed and efficiency, SOL has recently been up against a wall, struggling to surpass the crucial $100 mark. The price chart reflects a narrative of struggle and resistance, painting a picture of an asset in need of momentum.The technical outlook for SOL is looking promising. After a period of bullish activity that piqued the interest of many investors, SOL has hit a snag near the $100 resistance level. This resistance level represents a significant psychological and financial barrier, as it is where sell orders tend to accumulate, putting downward pressure on the price.\nDespite efforts to rally, the asset has been unable to generate the necessary momentum to overcome this threshold with ease and currently consolidates at it. One of the key factors influencing this lackluster performance could be the market's tepid reaction to the announcement of Solana phone Saga 2. The news, which might have been expected to inject some enthusiasm onto the market, failed to provide substantial support for Solana's price.\nLooking at the chart, the local support levels are clearly delineated. The first line of defense for SOL lies around the $88-$90 price range, where previous dips have found buyers waiting. Should this level fail to hold, the next support may not emerge until it reaches the more robust $70 level, which could act as a stronger foothold for the price.\nConversely, resistance beyond $100 is now more formidable than ever. With each rejection, the resolve of buyers weakens, and the $100 level transforms from a mere price point into a crucial psychological level you should not miss.\nThis article was originally published on U.Today"
        },
        {
            "title": "XRP Is Surprisingly Stable, Here's Why",
            "time": "- Jan 28, 2024",
            "content": "XRP Is Surprisingly Stable, Here's Why\n\n\n\n\n \n\n\n\n\n\nXRP/USD\n-0.94%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nETH/USD\n-1.01%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nSOL/USD\n+1.16%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nU.Today - XRP is currently holding above the crucial 200-day EMA, a level that has morphed into a dynamic support line. This pivotal line, sitting approximately at $0.55, is now the battleground where XRP's short-term destiny is being contested.\nIn recent days, XRP's price action has been characterized by its struggle to overcome a series of local resistance levels. A notable rejection was faced around the $0.63 mark, which has added to the narrative of an asset under pressure. Despite these rejections, the asset's ability to stay afloat above the 200-day EMA suggests underlying strength and potential for growth.\nXRP/USDT Chart by TradingViewThe market's oppressiveness toward XRP can be attributed to various factors, including lack of usecase for XRP and a poor performance throughout the 2023. However, the past has shown that XRP can swiftly shift from oppressed states to strong bullish rallies, often catching many off-guard.\nFor a scenario where XRP's growth continues, it is essential for the token to maintain its stand above the 200-day EMA. If this level holds, it can serve as a springboard for future bullish attempts. A decisive close above this moving average could stimulate investor confidence, potentially leading to a challenge of the recent resistance at $0.63. A break and hold above this level could signal a trend reversal and may pave the way for XRP to target higher resistances, possibly around the $0.70 to $0.75 regions.\nSolana is back in uptrendSolana is showing signs of entering an uptrend once more. The recent price chart reveals a pattern of resilience, with Solana forming a higher low that indicates a potential shift in market sentiment.After dipping to a support level around $88 on December 20, 2023, Solana has rebounded, forming a higher low near the $90 mark. This movement suggests accumulating strength and a possible change in direction from the previous downward trend. The local trendline resistance, which Solana is currently testing, is evident at approximately $97.50. \nTwo pivotal price levels stand out on Solana's chart. The first resistance level after the trendline sits near the $100 psychological mark. This round number has historically been a challenging point for Solana to breach decisively. Beyond that, the $104 level looms as the next significant barrier, which was a previous local high around January 3, 2024.\nConversely, on the support side, the level to watch is around $88, as mentioned earlier. This price has proven to be a firm foundation, with buyers stepping in to uphold Solana's valuation. A secondary support level is present near $85, just below the 50-day moving average, acting as a safety net for any potential retracements.\nEthereum's dominance prevailsEthereum swiftly cuts through resistance levels with a bullish fervor that has not been seen in recent times. After a spirited 8.8% pump, Ethereum has confidently surpassed the $2,500 and $2,600 milestones, setting its sights firmly on the next major resistance level at $3,000.The rapid growth witnessed in the past few days has been nothing short of impressive. Ethereum, which lingered around the $2,400 mark in the early days of February, has seen a significant influx of buying pressure, leading to a breakthrough past key resistance levels. This positive price action posits two potential scenarios for the smart contract giant.\nIn one scenario, Ethereum could continue its aggressive push, riding the wave of current market optimism towards the $3,000 target. If this momentum is maintained, and with the additional fuel from the recent high volume of trades, ETH could test $3,000 in the coming days. A consolidation above $2,600 would be crucial for this scenario to unfold, as it would establish a new support level, reinforcing investor confidence.\nAlternatively, given the volatile nature of the crypto markets, a retracement could occur before Ethereum reaches $3,000. This would likely see the asset retesting support at the $2,500 level, which if held, could serve as a springboard for a second wave towards and beyond $3,000.\nThis article was originally published on U.Today"
        },
        {
            "title": "Ethereum (ETH) Loses All of Its Gains, Bitcoin (BTC) Not Ready to Give up $40,000, Solana (SOL) Comeback Starts",
            "time": "- Jan 28, 2024",
            "content": "Ethereum (ETH) Loses All of Its Gains, Bitcoin (BTC) Not Ready to Give up $40,000, Solana (SOL) Comeback Starts\n\n\n\n\n \n\n\n\n\n\nETH/USD\n-1.01%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nBTC/USD\n-0.77%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nSOL/USD\n+1.16%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nU.Today - Ethereum has wiped out the gains it had accumulated over a sustained period. The ETH/USD price chart depicts a grim narrative as the digital asset has swiftly descended from its peak, retracing back to levels that question the sustainability of its prior growth.\nThe steep decline in Ethereum's price is a significant bearish signal. It reflects the market's hesitancy to invest at previous highs, most likely due to the underperformance Ethereum has shown in the recent past. This lack of traction and inability to initiate a recovery underscores the vulnerability of Ethereum's price in the current market climate.\nETH/USD Chart by TradingViewFocusing on the technical aspects, Ethereum has broken through what was once seen as a strong support level at approximately $2,350. This price point, which previously saw substantial buying interest, has now been breached, leading to a cascading effect as the asset searches for new support. The next critical support level is around $2,175, where buyers might emerge to stall the downfall.\nConversely, any attempts at recovery will first encounter resistance at around $2,338, a level that now marks the lower boundary of what was a consolidation range before the drop. A close above this level on significant volume could signal a temporary respite from selling pressure. However, the real test lies at higher resistance levels, previously established around $2,500, where ETH struggled to maintain upward momentum.\nBitcoin ready to fightRecent candlestick formations portray a scenario where Bitcoin is flirting with a critical resistance level, poised to either confirm a bearish trend or start a substantial recovery. The chart illustrates Bitcoin’s recent descent, as it lost its foothold at the higher price echelons it previously occupied. However, amid this downward movement, Bitcoin is showing signs of resilience. The latest candles indicate a potential reversal as they hover around a significant support level, which can be identified at approximately $37,000, a region where buyers have historically stepped in.\nA sustained hold above this point could catalyze renewed buying interest, which may drive the price toward the immediate resistance level at around $41,000. The significance of reclaiming this threshold cannot be understated, as it may invalidate the bearish outlook and signal a trend reversal.\nAs for the upper resistances, the $43,000 and $46,000 price levels stand out as notable barriers that Bitcoin would need to breach to cement a robust recovery narrative. Achieving such milestones could sway market sentiment positively, potentially ushering in a wave of optimism among investors.\nThe moving averages offer additional insight, suggesting a possible bullish crossover should the current momentum persist. This scenario would be further supported by a rise in trading volume, which typically accompanies decisive trend shifts.\nSolana among leadersSolana shows signs of a nascent comeback, presenting a bullish scenario amid a broader market recovery. However, investors tread cautiously, aware of the potential of a \"dead cat bounce\" since volume profiles signal restraint.Analyzing the SOL/USDT chart, we notice that Solana has established a local support level around the $70 price mark. This is characterized by multiple touches of this level over the past few weeks, each time resisting further downward movement. \nOn the flip side, the local resistance can be identified near the $96 level, which previously acted as support during Solana's consistent upward trend.\nThe price movement is currently sandwiched between the 50-day moving average acting as dynamic resistance and the 200-day moving average serving as potential dynamic support. The narrowing gap between these averages could squeeze the price action, possibly leading to a volatility breakout.\nThis article was originally published on U.Today"
        },
        {
            "title": "Ethereum (ETH) In Dangerous Position, Bitcoin (BTC) About to Lose $40,000, Shiba Inu (SHIB) At Local Support",
            "time": "- Jan 28, 2024",
            "content": "Ethereum (ETH) In Dangerous Position, Bitcoin (BTC) About to Lose $40,000, Shiba Inu (SHIB) At Local Support\n\n\n\n\n \n\n\n\n\n\nETH/USD\n-1.07%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nSHIB/USD\n-1.75%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nBTC/USD\n-0.77%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nU.Today - Ethereum finds itself shaky on the edge of a precarious position. The recent price chart indicates a concerning situation: the 26-day Exponential Moving Average (EMA), a key indicator of short-term momentum, is under threat. If this level fails to hold, Ethereum could see its value dip to the $2,347 mark, a scenario that may well trigger a more pronounced decline.\nThis potential slip below the 26 EMA is crucial because it suggests a weakening in buying pressure and a shift in market sentiment from accumulation to potential distribution. A break below this level would not only establish $2,347 as the next price floor but could also exacerbate the asset's losses, leading to further bearish momentum.\nETH/USD Chart by TradingViewThe Ethereum ecosystem has faced its share of challenges despite the rise of layer 2-networks, which have not catalyzed the anticipated rally. The broader market has similarly not exhibited the explosive bull run many investors had hoped for, with Ethereum’s trajectory reflecting this subdued market energy.\nAdditional support and resistance zones can be gleaned from the chart. On the support side, following the $2,347 level, the next critical support lies around $2,175.2 - a breach of which could see ETH test the psychological and technical support near the $2,000 level. Resistance, on the other hand, is firmly established at the recent high of $2,547.6. This price point serves as a litmus test for Ethereum’s ability to rebound and reclaim bullish momentum.\nThe current market dynamics, marked by cautious trading and a lack of definitive direction, have placed Ethereum in a zone of uncertainty. Investors are advised to monitor these levels closely, as a break below or above these could signal Ethereum's next significant move.\nBitcoin in troubleBitcoin finds itself at a precarious juncture as it teeters on the edge of the critical $40,000 mark. The recent price action paints a troubling picture for Bitcoin enthusiasts, with the asset losing its grip on the 50-day Exponential Moving Average, a key support level that has historically indicated bullish sentiment.As Bitcoin's price struggles to maintain the $40,000 level, the next potential foothold lies at the 100-day EMA. However, this level does not traditionally offer substantial support, and a breach below could precipitate a fall below $39,000, triggering heightened market concern. The chart reveals that the next major support zone stands near the $35,888 mark, a level that buyers might attempt to defend vigorously.\nOn the resistance front, Bitcoin faces a significant challenge at the $42,786 price level. Overcoming this resistance is crucial for Bitcoin to regain stability and demonstrate potential for a recovery. However, the market currently lacks the necessary liquidity to facilitate a strong rebound, as trading volumes remain relatively low.\nShiba Inu gets hitThe token is currently trading at a local support level, which is a make-or-break situation for its short-term future. A breakdown below this point could spell trouble, signaling a potential decline and testing the resilience of its investor base.The current market landscape for SHIB is challenging, with a noticeable lack of growth catalysts and low liquidity in the broader cryptocurrency market, both of which could exacerbate the asset's precarious position. \nHowever, there is a glimmer of hope. The descending trading volume accompanying SHIB's price consolidation suggests that bearish momentum could be waning. This deceleration of selling pressure often precedes a stabilization of price, or even a reversal if bulls regain control.\nIn terms of specific price levels, SHIB is currently finding tentative support around the $0.000027 mark. Should this level fail to hold, the next support zone lies near $0.000022, which may serve as a new accumulation point for buyers. On the resistance side, SHIB faces a hurdle at $0.000035, a breach of which could open the door to a retest of higher levels, possibly around the $0.000040 range.\nThis article was originally published on U.Today"
        },
        {
            "title": "Shiba Inu (SHIB) Becoming Bullish, Ethereum (ETH) Price Screams Rally Continuation, Bitcoin (BTC) Not Giving up Market Dominance",
            "time": "- Jan 28, 2024",
            "content": "Shiba Inu (SHIB) Becoming Bullish, Ethereum (ETH) Price Screams Rally Continuation, Bitcoin (BTC) Not Giving up Market Dominance\n\n\n\n\n \n\n\n\n\n\nBTC/USD\n-0.77%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nSHIB/USD\n-1.75%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nETH/USD\n-1.07%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nU.Today - Shiba Inu currently displays an ascending triangle pattern on the SHIB/USDT chart. This technical formation is widely recognized and could be a signal to a significant price surge for the meme.\nAn ascending triangle is characterized by a flat upper resistance line and a rising lower support line. This pattern suggests that buyers are gradually gaining ground against sellers, as each dip is bought up at a higher level than the previous one, indicating accumulating pressure for an upward breakout.\nSHIB/USDT Chart by TradingViewFor Shiba Inu, which has been lingering in a period of relatively nonexistent activity, this pattern could serve as massive fuel for volatility in the near future. Recent market conditions have seen a decline in interest toward legacy meme coins, with SHIB being no exception. The lack of significant developments within the Shiba Inu network has contributed to the muted activity around this cryptocurrency.\nIn contrast, the majority of the action in the meme coin sector has been taking place on the Solana network. This platform has become a hotbed for the deployment of new meme coins, which are exhibiting far greater volatility than those on the Ethereum network, where Shiba Inu resides. The brisk activity on Solana contrasts sharply with the sluggishness observed in Ethereum's meme coin space, drawing in traders and investors looking for quick gains and high excitement.\nEthereum's correction is temporaryThe Ethereum market is currently exhibiting a correction, and there are patterns that suggest a rally may not only be on the horizon but could also be in continuation. The asset has recently experienced a sharp downturn, movement that is readily apparent on intraday timeframes. However, such stark movements are often precursors to reversals, signaling that Ethereum could be gearing up for an upswing.A closer look at the charts shows Ethereum's price action respecting a series of key technical indicators which, together, build a case for potential upward momentum. The asset has been tracing back to touch base with its moving averages, a behavior that is typically followed by a rebound, as these levels can act as dynamic support zones.\nThis corrective phase is noteworthy, especially considering the robust rally Ethereum enjoyed in the preceding weeks. Corrections are a natural and healthy part of any asset's price trajectory, allowing for consolidation before the next leg up. For Ethereum, the current pullback could be shaking out weak hands, setting the stage for a stronger rally propelled by a more committed investor base.\nBitcoin's dominance not going anywhereAfter a brief breach below the 50-day EMA — a critical indicator of medium-term market sentiment — Bitcoin has clawed its way back above this pivotal level. This move indicates a bullish signal for market observers, suggesting that Bitcoin is not yet ready to relinquish its market dominance.However, the ascent above the 50 EMA has not been met with the kind of vigorous momentum that bulls would hope for. The growth has been moderate, hinting that Bitcoin might encounter selling pressure as it ascends. This is not unusual on the crypto markets, where significant moves often face immediate resistance as traders take profits and skeptics cast doubts.\nThe recent price action has been a roller coaster for Bitcoin, which saw its value tumble from highs around $47,000 to lows near $41,000. This downturn briefly shifted the spotlight to altcoins, which seized the moment to stage local rallies. The diversification of gains across the crypto spectrum during Bitcoin's periods of weakness is a trend that has become more pronounced as the overall market matures.\nYet Bitcoin's ability to push back above the 50 EMA serves as a reminder of its underlying strength and the confidence investors have placed in it. Despite the opportunity for altcoins to rise, Bitcoin remains the anchor of the crypto market, with its moves often dictating broader market sentiment. This recent rebound above a crucial technical level could be interpreted as Bitcoin's silent assertion that it is not ready to give up the throne just yet.\nThis article was originally published on U.Today"
        },
        {
            "title": "XRP Starts Moving Earlier, Solana (SOL) Already Stronger Than Everyone Else; Does Ethereum (ETH) Need More Fuel?",
            "time": "- Jan 28, 2024",
            "content": "© Reuters XRP Starts Moving Earlier, Solana (SOL) Already Stronger Than Everyone Else; Does Ethereum (ETH) Need More Fuel?\n\n\n\n\n \n\n\n\n\n\nXRP/USD\n-0.94%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nSOL/USD\n+1.16%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nETH/USD\n-1.07%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nU.Today - XRP appears to have begun its market movements earlier than anticipated. The chart shows a notable shift from the recent sideways trading pattern, as XRP starts to carve out a new direction.\nAs of the latest trends, XRP has been testing the support level around $0.50, a crucial psychological threshold for the asset. A sustained move below this level could signal further bearish momentum, potentially leading the price to test the next significant support zone around $0.47. \nXRP/USDT Chart by TradingViewOn the flip side, if XRP manages to stabilize and bounce back from the current support, the initial resistance is likely to be encountered near the $0.54 mark, where the 50-day moving average currently lies. This moving average has historically acted as a dynamic resistance level, and a breakout above could propel XRP toward the $0.56 level, which aligns with the 100-day moving average.\nFurther complicating the chart is the downward trendline that has been in play since the local high established in November. This trendline has repeatedly acted as resistance, pushing the price downward each time it has been tested. For a true reversal to be confirmed, XRP would need to break above this trendline with significant volume to validate the move.\nSolana is leading packSolana is manifesting its strength as the top performer among the top 10 cryptocurrencies by market capitalization. Despite overall market volatility, SOL's price action has been signaling a stronger recovery compared to other assets.At the time of analysis, Solana is trading around the $90 mark, having rebounded with considerable momentum from the support level near $78.35. This pivotal point, bolstered by the 100-day Exponential Moving Average (EMA), has served as a springboard for the recent bullish trend. The price of SOL has been consistently creating higher lows, indicative of strong buying interest at these levels.\nResistance for SOL is currently looming at the $100 psychological level, a breakthrough of which could propel the price toward the next significant resistance at $110. \nThe relative strength of Solana is further substantiated by the resurgence of a risk appetite on the market, particularly evidenced by the blossoming of meme coins. This renewed interest in higher-risk assets typically bodes well for ecosystems like Solana that support a variety of decentralized applications and niche crypto projects.\nEthereum needs pushThe Ethereum market is currently facing a confluence of challenges as it searches for the momentum to sustain its position. A recent chart analysis reveals an indecisive atmosphere among investors, with Ethereum struggling to find a strong directional move.At present, Ethereum is hovering around the $2,200 mark, a level that has seen significant activity and is currently acting as a temporary support. However, the lack of bullish conviction suggests that this support level may not hold if a new wave of selling pressure emerges. \nResistance levels are observed near the $2,400 range, where previous attempts to break higher have been met with a firm rejection, indicating a substantial barrier to upward movement.\nThe selling pressure is partly attributed to the recent news of Celsius Network liquidating approximately $1 billion worth of Ethereum holdings. This substantial amount has the potential to saturate the market, overwhelming current liquidity and triggering a downturn. As a result, the $2,000 psychological level is eyed as the next critical support zone, a breach of which could see a sharp decline toward the $1,950 region, where the 200-day moving average lies, providing stronger historical support.\nOn the flip side, if Ethereum can absorb the selling pressure and gain the necessary \"fuel,\" a push above the $2,400 resistance could open the path toward the $2,500 area before challenging the more formidable resistance at $2,600, which aligns with the 50-day moving average.\nThis article was originally published on U.Today"
        },
        {
            "title": "Dogecoin Founder Issues Bitcoin Statement on Further BTC Decline",
            "time": "- Jan 27, 2024",
            "content": "Dogecoin Founder Issues Bitcoin Statement on Further BTC Decline\n\n\n\n\n \n\n\n\n\n\nBTC/USD\n-0.81%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nU.Today - Billy Markus, who founded the iconic meme cryptocurrency Dogecoin together with Jackson Palmer back in 2013 and launched it, has taken to Twitter/X social media network to comment on the further plunge Bitcoin took earlier today as it went below the $39,000 level.\n“Shibetoshi Nakamoto”, as Markus is known on Twitter, stated in his recent tweet “Good morning to everyone except Bitcoin,” thus showing sarcastically his dissatisfaction with the volatility of the world’s largest cryptocurrency, the one which he and Palmer parodied when they created DOGE.\nEarlier today, the leading digital currency dived under $39,000, hitting $38,543. However, it quickly rebounded, adding 2.41% (versus the previous loss of 3.52%) and at the time of this writing, BTC is exchanging hands at $39,471.\nBitcoin bloodbath continuesSince the approval of Bitcoin exchange-traded funds by the Securities and Exchange Commission and the start of ETF trading on January 11, Bitcoin first responded with a sharp increase above the $49,000 level.However, that did not last long and Bitcoin started its rapid descent into the red. By now, it has lost a whopping 19.56%, falling from $49,000 to the current $39,471 price mark.\nAs reported, earlier today the cryptocurrency market was struck by a massive bloodbath as $100 million in Bitcoin and other cryptocurrencies were liquidated across various crypto trading venues.\nAside from that, according to a recent tweet of cryptocurrency analyst and trader Ali Martinez, over the period of the last two weeks, Bitcoin miners have dumped a large chunk of Bitcoin, getting rid of 70,000 BTC (the equivalent of $3 billion in fiat).\nBitcoin is not going into $30,000 range: Samson MowAside from that, Grayscale continues to dump Bitcoin from its Grayscale Bitcoin Trust onto the market. Yesterday, the company spearheaded by Michael Sonnenshein sold 14,292 BTC worth more than have a billion US dollars.Still, while a great many cryptocurrency traders hope that Bitcoin will drop into the $30,000 range, so they can start buying the dip, vocal Bitcoin maximalist and evangelist, CEO of Jan3, Samson Mow, does not believe it is likely to happen.\nIn the meantime, Mow remains a strong believer that Bitcoin will eventually reach the much-expected $1 million mark. However, he does not specify when it is likely to happen.\nThis article was originally published on U.Today"
        },
        {
            "title": "Bitcoin Price Action Explained: Here's Real Reason Why BTC Dipped After ETF Approval",
            "time": "- Jan 27, 2024",
            "content": "© Reuters Bitcoin Price Action Explained: Here's Real Reason Why BTC Dipped After ETF Approval\n\n\n\n\n \n\n\n\n\n\nBTC/USD\n-0.77%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nU.Today - 2024 has already proven to be a wild trip for Bitcoin investors. In what was likely the most exciting financial product launch in history, the SEC approved 10 spot Bitcoin ETF products for trading in U.S. marketplaces.\nIn reaction, BTC prices rose to a new multi-year high, reaching $49,102. The market then fell 18% over the weekend, reaching fresh year-to-date lows of $40,236.\nAs with any important event, holders of Bitcoins enjoy debating whether it was priced in or not.\nIn this regard, Julio Moreno, the head of research at CryptoQuant, debunks the widely circulated narrative that the Bitcoin price drop was caused by Grayscale's GBTC selling Bitcoin.\nBefore being converted to an ETF from a trust, Grayscale Bitcoin Trust (GBTC) was one of the only options for stock traders in the United States to obtain exposure to Bitcoin price swings without having to purchase the actual cryptocurrency.\nWhile GBTC has seen remarkable outflows after its uplisting into an ETF, a chunk of these have been from investors moving to lower-fee ETFs.\nMoreno highlighted that, while GBTC sold approximately 60,000 Bitcoins, other Bitcoin ETFs net purchased roughly 72,000 Bitcoins, thus offsetting the sales of BTC from Grayscale's GBTC.\nHe attributes the volatility in Bitcoin's price to selling by Bitcoin holders (short-term traders and whales) who took profits following last year's surge, noting that the ETF approval might just be the \"sell-the-news\" event.\nWhat on-chain data saysAccording to on-chain analytics firm Glassnode, Bitcoin's price drop might have been driven by both derivatives leverage and spot profit taking.However, several metrics in both the on-chain and derivatives domains suggest that a non-trivial portion of Bitcoin investors did treat the ETF approval as a sell-the-news event.\nWhile there are other key driving factors behind the interim volatility, both futures and options markets have seen a meaningful uptick in open interest (OI) since mid-October, according to Glassnode.\nOpen interest in both markets remains around multi-year highs, showing that leverage is rising and becoming a more dominant force in markets.\nAt the time of writing, BTC was up 0.58% in the last 24 hours to $41,543, per CoinMarketCap data.\nThis article was originally published on U.Today"
        },
        {
            "title": "ETH ETF Next? Seasoned VC Vance Spencer Shares His Views",
            "time": "- Jan 27, 2024",
            "content": "© Reuters. ETH ETF Next? Seasoned VC Vance Spencer Shares His Views\n\n\n\n\n \n\n\n\n\n\nBITO\n+5.62%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nU.Today - As the new bull market is gaining traction, Netflix (NASDAQ:NFLX) alum and seasoned crypto VC Vance Spencer indicates a number of milestones the blockchain segment could reach in the coming two years. While his forecast sounds optimistic, he also recommends being prepared for a \"roller coaster.\"\nEthereum ETF could be next, Vance Spencer opinedThe fourth Bitcoin (BTC) halving, Ethereum ETF approval and growing institutional adoption of digital assets are \"next\" for us in 2024, Spencer shared with his 85,000 followers on X. In general, the crypto journey at this stage should be treated as a marathon, not a sprint.Also, Web3 games will bring the next 100 million active users to the cryptocurrency scene. Regulatory hostility might be on borrowed time as the odds of \"pro-crypto\" administration in the U.S. coming in 2025 are estimated at 70%.\nIn terms of macroeconomic context, the market will go through an entire rate cutting cycle with rates getting back to 2-3%. Last time, this indicator was below 2% in mid-2022.\nAt the same time, the situation on the cryptocurrency market will not be all roses: Every market participant should be prepared for roller coasters in the next 24 months.\nIt should be noted that Spencer almost managed to exactly predict the date of the Bitcoin ETFs approval. In early July, he opined that they could be green-lit by the end of 2023.\n$1 billion for DeFis: New milestone for 2024-2025In the same July thread he stressed that the Bitcoin ETF approval would pave the path for ETFs on various altcoins.Alongside the ETFs saga, the VC investor foresees bright midterm prospects for the DeFi sphere. As crypto prices go up, revenues of DeFi protocols will grow \"superlinearly.\" At least two major DeFis will cross $1 billion in revenue in the next 24 months.\nPreviously, he foresaw the emergence of the \"FAANG of DeFi\" that would demonstrate sustainable cash flow and will not be vulnerable to \"vampire attacks.\"\nThis article was originally published on U.Today"
        },
        {
            "title": "Ethereum (ETH) Staking Ratio Surprisingly Keeps Surging Despite Shapella",
            "time": "- Jan 27, 2024",
            "content": "Ethereum (ETH) Staking Ratio Surprisingly Keeps Surging Despite Shapella\n\n\n\n\n \n\n\n\n\n\nETH/USD\n-1.07%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nADA/USD\n-1.16%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nU.Today - Ki Young Ju, founder and CEO of CryptoQuant, leading on-chain analytical firm, shared his views on the Ethereum (ETH) staking progress. He admits he was wrong about Shapella hard fork's effects.\nEthereum (ETH) staking ratio surges to 24% and countingEthereum (ETH) staking ratio, i.e., the percentage of ETH coins locked in staking, reaches 24% and keeps surging. Meanwhile, only 11% of the ETH supply is stored on centralized exchanges. The data was shared by Ki Young Ju on X today, on Jan. 18, 2024.As such, it is safe to say that the overhyped Ethereum (ETH) upgrade Shapella that allowed stakers to withdraw their coins for the first time since December 2020 did not result in massive unstaking:\nEthereum's (ETH) Shapella was activated in April 2023. As crypto markets were still dominated by bearish sentiment, analysts were expecting withdrawals and consecutive sell-offs of Ethereum (ETH).\nThe Ethereum (ETH) price also managed to go through this event without significant losses: as stakers withdrew 1 million Ethers (ETH) in first week post-Shapella, the ETH price was fluctuating between $2,000 and $2,100.\nStaked Ethereums (ETH) are mostly profitable, Mr. Ki Young Ju adds. While the realized price for staking inflows is $2,014, the current ETH rate is $2,519. As such, the average Ether \"stake\" is being held with a significant 25% profit.\nThe aggregated volume of the Ethereum (ETH) staking ecosystem is estimated at a whopping $72 billion, with 4.25% in APY, Staking Rewards data says.\nСardano (ADA) staking close to surpassing Solana (SOL)At the same time, the largest Ethereum (ETH) competitors might be close to a historic \"flippening.\" The Solana (SOL) staking ratio is plummeting. The indicator lost over 20% in the last week and dipped below 67%.Meanwhile, the Cardano (ADA) staking ecosystem added 0.06% in the last seven days and is getting closer to 64%. At the same time, the USD-denominated volume of Solana (SOL) staking is over 200% larger than that of Cardano (ADA).\nOut of all mainstream altcoins, Mina Protocol (MINA) demonstrates the largest staking ratio: its stakers locked over 91% of the circulating supply.\nAptos (APT) and Sui (SUI) follow the Mina Protocol (MINA) with 85%-86% in staking ratio.\nThis article was originally published on U.Today"
        },
        {
            "title": "XRP to Crash to Virtual Zero Against Bitcoin, Predicts Max Keiser",
            "time": "- Jan 27, 2024",
            "content": "© Investing.com XRP to Crash to Virtual Zero Against Bitcoin, Predicts Max Keiser\n\n\n\n\n \n\n\n\n\n\nXRP/USD\n-0.98%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nBTC/USD\n-0.81%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nU.Today - Max Keiser, a prominent Bitcoin advocate and critic of altcoins, has once again attacked XRP.\nIn a recent X post he captioned \"XRP Crash Update,\" Keiser calls XRP \"a centralized garbage that is mathematically guaranteed to trade at virtual zero against Bitcoin.\"\nKeiser posted a screenshot of the XRP chart showing its price decline. At the time of writing, XRP was down 5.68% in the last 24 hours to $0.498. Bitcoin fell 5.25% in the same time frame, trading at $38,750, mirroring the market's poor performance.\nBitcoin (BTC) fell below $39,000 in Tuesday's market crash, wiping out virtually all of the previous two months' gains ahead of spot exchange-traded fund (ETF) approvals in the United States.\nXRP began to surge against Bitcoin on Jan. 9 after hitting a bottom that marked multiyear lows in its pairing. This trend sustained for a while until XRP began mirroring the BTC price trend, subsequently entering into range-trading in its BTC pairing.\nXRP continues to show resilienceKeiser has oftentimes expressed his scorn for XRP and Ripple in the wake of its legal battle with the United States Securities and Exchange Commission (SEC), predicting that Ripple was going to lose the lawsuit and that XRP was a \"security.\"However, Keiser's predictions have not always been correct, as Ripple won a significant victory in the SEC litigation after the judge ruled that XRP was not a security. The SEC also dropped its accusations against Ripple executives Brad Garlinghouse and Chris Larsen.\nXRP has also demonstrated resilience, maintaining its position among the top 10 cryptocurrencies by market capitalization despite legal woes and market uncertainty. XRP is now the sixth-largest cryptocurrency by market capitalization, valued at more than $27 billion.\nThat said, whether XRP will crash to virtual zero in its Bitcoin pairing or rise to new heights remains yet to be seen.\nThis article was originally published on U.Today"
        },
        {
            "title": "Grayscale Dumps $2.14 Billion in BTC, Ripple CLO Exposes Major Misconduct in Coinbase v. SEC Case, Gemini's Cryptic XRP Posts Stir Community: Crypto News Digest by U.Today",
            "time": "- Jan 27, 2024",
            "content": "Grayscale Dumps $2.14 Billion in BTC, Ripple CLO Exposes Major Misconduct in Coinbase v. SEC Case, Gemini's Cryptic XRP Posts Stir Community: Crypto News Digest by U.Today\n\n\n\n\n \n\n\n\n\n\nCOIN\n+3.46%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nU.Today - Here are the top three news stories over the past day presented to you by U.Today.\nGrayscale dumps $2.14 billion in Bitcoin (BTC) post-ETF approvalAccording to recent data provided by Lookonchain X account, Grayscale decreased its Bitcoin holdings by 52,227 BTC valued at $2.14 billion. This divestment followed the recent approval of spot Bitcoin ETFs by the SEC. At the moment, Grayscale is holding 566,973 BTC worth $23.21 billion. The Grayscale's move to sell such a substantial portion of its BTC holdings ignited significant speculation among the members of the crypto community. As suggested by analysts, Grayscale may have strategically moved its assets to capitalize on the growing institutional interest in the cryptocurrency after spot Bitcoin ETFs were greenlit. Meanwhile, Bitcoin's price has dropped by 5% over the past 24 hours; per CoinMarketCap, BTC is currently trading at $38,654.Coinbase (NASDAQ:COIN) v. SEC: Ripple's chief lawyer exposes major misconductIn a recent X post, Stuart Alderoty, chief legal officer at Ripple, unveiled what he believes to be major misconduct by the SEC following the recent hearing in the Coinbase case. The regulator is accusing the exchange of selling securities that were not registered, a claim that Coinbase is strongly disputing. However, Alderoty's post defies the SEC's narrative, stating that their focus on whether investors are \"pooling [their] capital with the promoter's efforts\" is fundamentally flawed. The lawyer argues, citing the influential Revak case, that the Howey test requires more than mere investment in effort; it demands an investment in a common enterprise.Gemini’s mysterious XRP tweets spark speculation within communityThe XRP community was recently stirred up by the latest X posts by Gemini, a major crypto exchange. The posts included several mentions of the Ripple-affiliated token, with phrases like \"Don't forget about xrp,\" \"xcited about xrp\" and \"xrriving shortly\" causing quite a buzz among Gemini's followers and market participants. Notable community influencers, such as Crypto Eri, took to the posts' comments to share their guesses about the meaning behind the cryptic messages. According to some suggestions, Gemini could be hinting at a new European Union joint venture for a spot XRP ETF, considering Gemini's recent approval as a Digital Asset Service Provider (DASP) in France and its role as a custodian for VanEck’s newly launched spot Bitcoin ETF.This article was originally published on U.Today"
        },
        {
            "title": "Asia stocks gain as China stimulus softens Evergrande blow",
            "time": "- Jan 29, 2024",
            "content": "© Reuters. FILE PHOTO: A passerby walks past an electric monitor displaying recent movements of various stock prices outside a bank in Tokyo, Japan, March 22, 2023. REUTERS/Issei Kato/File Photo\n\n\n\n\n \n\n\n\n\n\nUS500\n-0.07%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nJP225\n+0.84%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nHK50\n+0.79%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nDX\n+0.03%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nLCO\n+0.43%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nCL\n+0.44%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nCME\n+0.57%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nCMWAY\n+0.18%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nDXY\n-0.01%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nBy Kevin Buckland TOKYO (Reuters) -Asian stocks started the week on the front foot, as new steps by Beijing to stabilise the local market outweighed the drag on sentiment from the liquidation of property giant China  Evergrande  (HK:3333). However, investors were also sensitive to geopolitical risks with oil rising after a Houthi missile attack caused a fire on a fuel tanker in the Red Sea and a drone attack killed three U.S. troops in Jordan. The dollar and U.S. Treasury yields hovered in the middle of recent ranges ahead of a highly anticipated Federal Reserve policy meeting later in the week. In general, the mood in Asia was upbeat with MSCI's broadest index of Asia-Pacific shares outside Japan up 0.7% as of 0610 GMT. The main drag to stocks came from a Hong Kong court order to liquidate Evergrande, the poster child of China's property meltdown. Hong Kong's Hang Seng trimmed gains on the news to be up 0.74%, off the 1.9% gain made after China's securities regulator said on Sunday it would fully suspend the lending of restricted shares. Mainland China blue chips had struggled to make headway early in the session, and eventually slumped 0.64%. Elsewhere, though, Chinese stimulus optimism provided additional momentum to markets that had already started the day on a firm footing. Japan's Nikkei closed up 0.77%, while South Korea's Kospi advanced 1.47%. \"People want to believe in what (Beijing is) doing, it's just that they had a little bit of a hiccup in terms of communicating their policy intent at the beginning of the year,\" said Damien Boey, chief macro strategist at Barrenjoey in Sydney. \"Now, authorities seem to be trying to rectify that (and) unsurprisingly, you are now starting to see stabilisation in Chinese equities,\" he said. \"It may not exactly be the bottom right now, but I think things will eventually get better with a few bumps along the way.\" U.S. stock futures pointed slightly lower after the S&P 500 slipped 0.07% on Friday to snap five straight days of fresh all-time closing highs. The backdrop for that was continued moderation in U.S. consumer inflation in Friday's data, which added to the narrative for Fed rate cuts in coming months but also suggested policy makers had little pressure to rush. Markets expect the Fed to keep policy steady on Wednesday, but will be hunting for clues on when a first rate cut might come. Economists mostly predict June, but traders are pricing the risk of a March move at essentially a coin toss, according to CME Group's (NASDAQ:CME) FedWatch Tool. The U.S. dollar index, which tracks the currency against six major peers, stuck to the middle of its range of the past two weeks at 103.52, little changed from Friday. Long-term Treasury yields declined about 3 basis points to 4.1315%, putting them near the centre of their range since Jan. 18. Last week's U.S. data continued the \"remarkable run\" of not-too-hot and not-too-cold economic indicators, pointing to a soft landing and a May start to policy easing, Commonwealth Bank of Australia (OTC:CMWAY) strategists wrote in a client note. Odds for a March move should continue to be priced out this week, leading the dollar index to test 104 and bond yields to rise \"modestly,\" they said. The dollar was little changed at 148.06 yen, while the euro eased 0.1% to $1.08395. Sterling was steady at $1.2704. In energy markets, Brent crude futures rose 29 cents, or 0.4%, to $83.84 a barrel and U.S. West Texas Intermediate crude gained 34 cents, or 0.4%, to $78.35 a barrel amid escalating risks of a widening of the Middle East conflict, which could disrupt supplies. \nSafe-haven gold added 0.33% to $2,024.91. Cryptocurrency bitcoin ticked up to $42,178."
        },
        {
            "title": "Oil climbs as tensions escalate in Middle East",
            "time": "- Jan 28, 2024",
            "content": "© Reuters. A view shows oil tanks of Transneft oil pipeline operator at the crude oil terminal Kozmino on the shore of Nakhodka Bay near the port city of Nakhodka, Russia August 12, 2022. REUTERS/Tatiana Meel\n\n\n\n\n \n\n\n\n\n\nLCO\n+0.43%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nCL\n+0.44%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nBy Florence Tan SINGAPORE (Reuters) -Oil prices climbed on Monday after a drone attack on U.S. forces in Jordan added to worries over supply disruption in the Middle East as Houthi rebels stepped up their attacks on vessels in the Red Sea, hitting a Trafigura-operated fuel tanker. Risks of a widening conflict comes as Russian refined product exports are set to fall, with several refineries under repair following drone attacks. Brent crude futures rose 29 cents, or 0.4%, to $83.84 a barrel by 0230 GMT after hitting a session-high of $84.80. U.S. West Texas Intermediate crude gained 34 cents, or 0.4%, to $78.35 a barrel after reaching an intraday high of $79.29 earlier in the session. The attack on U.S. troops in a drone strike in Jordan raised concerns of a wider conflict in the oil-rich Middle East. \"We believe the death of three U.S. service members today in Jordan marks a critical inflection point in the ongoing conflict in the Middle East and raises a specter of a more substantial U.S. involvement in the war,\" RBC Capital analyst Helima Croft said in a note, adding that a more direct confrontation with Iran raises the specter of regional energy supply disruptions. Commodities trader Trafigura said on Saturday it was assessing the security risks of further Red Sea voyages after firefighters put out a blaze on a tanker attacked by Yemen's Houthi group a day earlier. \"Disruptions to supply have been limited, but that changed on Friday after an oil tanker operating on behalf of Trafigura was hit by a missile off the coast of Yemen,\" ANZ analysts said in a note. \"With oil tankers linked to the U.S. and UK now under threat of attack, the market is likely to reprice the risk of disruptions.\" Both contracts rose for a second week in a row and settled at their highest in nearly two months on Friday, supported by Middle East and Russian supply concerns while positive U.S. economic growth and signs of Chinese stimulus boosted demand expectations. \"The air of complacency lingering around the oil market has evaporated,\" IG markets analyst Tony Sycamore said. \"Dips in WTI are likely to find buyers back towards the 200-day moving average at $77.60, before a stronger layer of support at $75.00 from buyers looking for a push into the low $80's.\" Russia will likely cut exports of naphtha, a petrochemical feedstock, by some 127,500 - 136,000 barrels per day, or around a third of its total exports, after fires disrupted operations at refineries on the Baltic and Black Seas, according to traders and LSEG ship-tracking data. \nOn Feb. 1, leading ministers from the Organization of the Petroleum Exporting Countries (OPEC) and allies led by Russia, known as OPEC+, will meet online. However, OPEC+ will likely decide its oil production levels for April and beyond in the coming weeks, OPEC+ sources said, as the meeting would take place too early for decisions to be made on further output policy."
        },
        {
            "title": "Top 5 things to watch in markets in the week ahead",
            "time": "- Jan 28, 2024",
            "content": "© Reuters \n\n\n\n\n \n\n\n\n\n\nUS500\n-0.07%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nMSFT\n-0.23%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nGOOGL\n+0.21%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nAAPL\n-0.90%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nAMZN\n+0.87%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nMETA\n+0.24%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nGOOG\n+0.10%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nInvesting.com -- It’s set to be an action-packed week in markets with the Federal Reserve’s first meeting of the year, a flurry of big tech earnings and the latest U.S. jobs report. The Bank of England also holds its first policy meeting of 2024 while data out of China is expected to remain gloomy. Here’s what you need to know to start your week.\n\nFed ahead\n\nThe Fed is widely expected to keep interest rates unchanged on Wednesday with investors eagerly awaiting any indication that officials believe they have progressed enough in their battle against inflation to begin cutting rates sooner rather than later.\nInvestors have pushed expectations for the Fed’s first rate cut to May from March following recent strong economic data and statements from Fed officials that suggested that cuts may not be as aggressive as expected.\nData on Friday indicated that inflation is moderating but consumer spending remains robust, leading to concerns that price pressures could begin to mount again.\nInvestors will be closely watching Fed Chair Jerome Powell’s post policy meeting press conference for any insights into how officials have been interpreting recent economic data.\n\nJobs report\n\nHard on the heels of the Fed decision the U.S. is to release the January jobs report on Friday, with the economy expected to have added 177,000 new jobs, slowing from 216,000 the prior month.\nThe recent stock market rally which has powered the S&P 500 to record highs has been driven by expectations of a U.S. economic “soft-landing” in which growth remains stable while inflation cools.\nA weaker than expected reading could indicate that the 525 basis points of rate increases delivered by the Fed since 2022 are finally starting to bite, while stronger-than-expected hiring could bolster the case for the central bank to keep rates higher for longer.\nThe economic calendar also includes data on JOLTS job openings and consumer confidence on Tuesday, followed a day later by a report on private sector payrolls and weekly data on initial jobless claims on Thursday.\n\nMegacap earnings\n\nEarnings will be a major focal point in the week ahead with five of the massive “Magnificent Seven” growth and technology stocks that have powered markets higher for much of the last year reporting.\nAlphabet (NASDAQ:GOOGL) and Microsoft (NASDAQ:MSFT) are due to report results on Tuesday, followed by Apple (NASDAQ:AAPL) and Amazon (NASDAQ:AMZN) on Thursday with Meta Platforms (NASDAQ:META) closing out the week on Friday.\nWith the S&P 500 officially in a bull market, the Magnificent Seven's results will be crucial in determining whether the index can maintain its momentum.\nCollectively, the market capitalization of Alphabet, Microsoft, Apple, Amazon and Meta account for nearly 25% of the S&P 500, giving them an outsize influence on the performance of the broader index.\n\"There’s not this monolithic performance among those stocks anymore,\" said Liz Ann Sonders, chief investment strategist at Charles Schwab told Reuters. \"If there is a downside to earnings … that could take the bloom off the rose\" for the market as a whole.\n\nBank of England\n\nThe BoE is expected to keep interest rates on hold on Thursday and while it may drop its long-held warning that it will hike rates again if inflation rebounds it is expected to indicate that rates need to remain restrictive for an extended period.\nThe latest U.K. jobs report showed that wage growth rose at the slowest pace in almost a year in the three months to November, but inflation unexpectedly rose to 4% in December.\nBritain's economy started 2024 on a stronger footing but data last week indicated that supply disruptions in the Red Sea are reigniting inflation in the manufacturing sector.\nThe BoE raised interest rates 14 times between December 2021 and August 2023, taking rates to a peak of 5.25% after inflation surged to a 41-year high of 11.1% in late 2022.\n\nChina PMIs\n\nChina is to release official purchasing managers' index (PMI) data on Wednesday that is likely to show that the world’s second largest economy remains on a shaky footing.\nChina's economy expanded by 5.2% in 2023, but its post-pandemic recovery has been shaky, with a protracted housing downturn, mounting deflationary risks and slowing global growth casting clouds over the outlook for this year.\nChina's central bank announced last Wednesday that it was making a 50-basis point cut to bank reserves, the biggest in two years, sending a strong signal of support for a fragile economy and the country's plunging stock markets.\nStill, analysts say more stimulus is needed this year to get economic activity on more solid footing.\n--Reuters contributed to this report"
        },
        {
            "title": "Reaction to drone strike on US troops in Jordan",
            "time": "- Jan 29, 2024",
            "content": "© Reuters. FILE PHOTO: U.S. President Joe Biden delivers a prime-time address to the nation about his approaches to the conflict between Israel and Hamas, humanitarian assistance in Gaza and continued support for Ukraine in their war with Russia, from the Oval Offi\n\n\nWASHINGTON (Reuters) - Three U.S. service members were killed and as many as 34 wounded, United States officials said on Sunday, after a drone attack in Jordan that they linked to Iranian-backed militants.  The attack is a major escalation of the tensions in the Middle East sparked by Hamas' attack in Israel on Oct. 7 and Israel's retaliatory strikes that have devastated Gaza. Here are reactions from key policy makers in the United States and several countries:  DEMOCRATIC US PRESIDENT JOE BIDEN \"The three American service members we lost were patriots in the highest sense. And their ultimate sacrifice will never be forgotten by our nation ... We will carry on their commitment to fight terrorism. And have no doubt - we will hold all those responsible to account at a time and in a manner our choosing.\" REPUBLICAN FORMER PRESIDENT DONALD TRUMP \"The drone attack on a U.S. Military Installation in Jordan, killing 3 American service members, and wounding many more, marks a horrible day for America ... This brazen attack on the United States is yet another horrific and tragic consequence of Joe Biden's weakness and surrender.\" LLOYD AUSTIN, US DEFENSE SECRETARY \"Iran-backed militias are responsible for these continued attacks on U.S. forces, and we will respond at a time and place of our choosing.\" MICHAEL MCCAUL, REPUBLICAN US HOUSE FOREIGN AFFAIRS PANEL CHAIR \"We need a major reset of our Middle East policy to protect our national security interests and restore deterrence.\" MITCH MCCONNELL, US SENATE REPUBLICAN LEADER \"Last night, the cost of failure to deter America's adversaries was again measured in American lives. We cannot afford to keep responding to this violent aggression with hesitation and half-measures ... The entire world now watches for signs that the President is finally prepared to exercise American strength to compel Iran to change its behavior. Our enemies are emboldened.\" CHUCK SCHUMER, US SENATE DEMOCRATIC LEADER \"We mourn the deaths of the three service members killed by a drone attack in Jordan from an Iran-backed militant group. We are all praying for the safety and recovery of the dozens who were injured. My heart is with the families of those killed and injured. We must work to hold those responsible accountable.\" REPRESENTATIVE HAKEEM JEFFRIES, DEMOCRATIC HOUSE MINORITY LEADER \"Every single malignant actor responsible must be held accountable.\" EGYPT'S FOREIGN MINISTRY \"Egypt affirmed its strong condemnation of any terrorist acts that threaten the security and stability of the Hashemite Kingdom of Jordan, expressing full solidarity with Jordan in this delicate situation... Egypt emphasized the necessity of confronting all forms of terrorism and rejecting all manifestations of violence to ensure the stability of the region.\" ISRAEL'S FOREIGN AFFAIRS MINISTER ISRAEL KATZ \"We stand united in our values and battle against a common enemy. Their sacrifice will always be remembered. Rest in peace. Wishing a speedy recovery to the injured.\"  ROGER WICKER, RANKING REPUBLICAN ON US SENATE ARMED SERVICES COMMITTEE \n\"We must respond to these repeated attacks by Iran and its proxies by striking directly against Iranian targets and its leadership. The Biden administration's responses thus far have only invited more attacks.\" JACKY ROSEN, DEMOCRAT ON US SENATE ARMED SERVICES COMMITTEE \"Iran must be held accountable.\""
        },
        {
            "title": "HK court orders China Evergrande to liquidate with debts of $300...",
            "time": "- Jan 28, 2024",
            "content": "© Reuters. FILE PHOTO: The Evergrande Center of China Evergrande Group is seen in Shanghai, China September 24, 2021. REUTERS/Aly Song/File Photo\n\n\n\n\n \n\n\n\n\n\n3333\n-21.36%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nBy Clare Jim and Xie Yu HONG KONG (Reuters) -A Hong Kong court on Monday ordered the liquidation of property giant China  Evergrande  (HK:3333) Group, a move likely to send ripples through China's crumbling financial markets as policymakers scramble to contain a deepening crisis. Justice Linda Chan decided to liquidate the world's most indebted developer, with more than $300 billion of total liabilities, after noting Evergrande had been unable to offer a concrete restructuring plan more than two years after defaulting on a bond repayment and after several court hearings.  \"It is time for the court to say enough is enough,\" said Chan, who will give her detailed reasoning later on Monday. Evergrande chief executive Siu Shawn told Chinese media the company will ensure home building projects will still be delivered despite the liquidation order. The order would not affect the operations of Evergrande's onshore and offshore units, he added. The decision sets the stage for what is expected to be drawn-out and complicated process with potential political considerations, given the many authorities involved. Offshore investors will be focused on how Chinese authorities treat foreign creditors when a company fails. \"It is not an end but the beginning of the prolonged process of liquidation, which will make Evergrande's daily operations even harder,\" said Gary Ng, senior economist at Natixis. \"As most of Evergrande's assets are in mainland China, there are uncertainties about how the creditors can seize the assets and the repayment rank of offshore bondholders, and situation can be even worse for shareholders.\" Evergrande's shares were trading down as much as 20% before the hearing. Trading was halted in China Evergrande and its listed subsidiaries China Evergrande New Energy Vehicle Group and Evergrande Property Services after the verdict. COMPLICATED PROCESS Evergrande, which has $240 billion of assets, sent a struggling property sector into a tailspin when it defaulted on its debt in 2021 and the liquidation ruling will likely further jolt already fragile Chinese capital and property markets.  Beijing is grappling with an underperforming economy, its worst property market in nine years and a stock market wallowing near five-year lows, so any fresh jolt to investor confidence could further undermine policymakers' efforts to rejuvenate growth. Evergrande applied for another adjournment on Monday as its lawyer said it had made \"some progress\" on the restructuring proposal. In the latest offer, the developer proposed creditors swap their debts into all the shares the company holds in its two Hong Kong units, compared to stakes of about 30% in the subsidiaries ahead of the last hearing in December.  Evergrande's lawyer argued liquidation could harm the operations of the company, and its property management and electric vehicle units, which would in turn hurt the group's ability to repay all creditors. Evergrande had been working on a $23 billion debt revamp plan with a group of creditors known as the ad hoc bondholder group for almost two years.  \"We're not surprised by the outcome and it's a product of the company failing to engage with the ad hoc group,\" said Fergus Saurin, a Kirkland & Ellis partner who had advised the offshore bondholders. \"There has been a history of last minute engagement which has gone nowhere. And in the circumstances, the company only has itself to blame for being wound up.\" Evergrande cited a Deloitte analysis during a Hong Kong court hearing in July that estimated a recovery rate of 3.4% if the developer were liquidated. After Evergrande said in September its flagship unit and its chairman Hui Ka Yan were being investigated by the authorities for unspecified crimes, creditors now expect a recovery rate of less than 3%. The ruling is expected to have little impact on the company's operations including home construction projects in the near term, as it could take months or years for the offshore liquidator appointed by the creditors to take control of subsidiaries across mainland China - a different jurisdiction from Hong Kong. \nThe liquidation petition was first filed in June 2022 by Top Shine, an investor in Evergrande unit Fangchebao which said the developer had failed to honour an agreement to repurchase shares it had bought in the subsidiary. Before Monday, at least three Chinese developers have been ordered by a Hong Kong court to liquidate since the current debt crisis unfolded in mid-2021."
        },
        {
            "title": "5 AI Stocks Set to Report Explosive Profit and Sales Growth",
            "time": "- Jan 26, 2024",
            "content": "NDX\n-0.55%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nMSFT\n-0.23%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nGOOGL\n+0.21%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nAAPL\n-0.90%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nAMZN\n+0.87%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nMETA\n+0.24%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nXLK\n-1.18%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nGOOG\n+0.10%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nOKTA\n+0.31%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nSNOW\n-1.71%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nPLTR\n-0.70%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nAPP\n+0.52%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nS\n+2.29%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nWall Street’s Q4 earnings season gathers momentum next week as the biggest names in the world get set to report their latest results.\nWhile most of the focus will be on the mega-cap tech stocks, there are several companies poised to trounce their earnings expectations thanks to their innovations in artificial intelligence.\nInvestors could consider adding these stocks to their portfolios ahead of their respective results.\nLooking for more actionable trade ideas to navigate the current market volatility? Members of InvestingPro get exclusive ideas and guidance to navigate any climate. Learn More »\nThe fourth quarter earnings season gathers momentum next week with some of the biggest names in the world set to report their latest financial results.\nThe list of big companies include Alphabet (NASDAQ:GOOGL), Microsoft (NASDAQ:MSFT), Meta Platforms (NASDAQ:META), Amazon (NASDAQ:AMZN), and Apple (NASDAQ:AAPL).\nWhile most of the focus will be on the mega-cap group of technology stocks, there are several fast-growing names set to enjoy robust earnings and sales growth thanks to surging demand for their innovative products and services.\nHere are five stocks worth owning ahead of their quarterly reports in the weeks ahead as growth prospects in artificial intelligence and machine learning remain strong.1. PalantirEarnings Date: Monday, Feb. 5\nEPS Growth Estimate: +75% Y-o-Y\nRevenue Growth Estimate: +18.6% Y-o-Y\nPalantir's (NYSE:PLTR) AI-driven solutions are expected to be a driving force behind its future sales growth, particularly as businesses and governments around the world increasingly rely on sophisticated data-driven decision-making.\nThe Denver, Colorado-based company is scheduled to deliver its fourth-quarter earnings and revenue update on Monday, February 5 and results are expected to get a boost from soaring demand for its new generative AI platform - which it calls AIP.\nAnalysts have become increasingly bullish on the data-mining specialist ahead of the print.\nAccording to an InvestingPro survey: all 12 of the analysts surveyed in the last 90 days upwardly revised their earnings forecast to reflect a gain of 72% from their initial estimates.\nUpcoming Earnings\nSource: InvestingPro\nConsensus calls for Palantir to report Q4 earnings per share of $0.07, surging 75% from EPS of $0.04 in the same quarter a year earlier.\nRevenue is forecast to increase 18.6% from the year-ago period to $603.5 million, as Palantir benefits from robust demand for its data analytics tools and services from both government and commercial clients amid the current climate.\nAs ProTips points out, Palantir is in solid financial health condition, thanks to its impressive gross profit margins, rising net income, and robust earnings prospects.\nOn the downside, ProTips highlights that Palantir trades at high earnings and revenue multiples, underlining risks associated with overvaluation.\nPalantir Data\nSource: InvestingPro \nWith that being noted, PLTR stock appears to be trading at a premium according to several valuation models on InvestingPro.\nThe average ‘Fair Value’ for Palantir stands at $13.89, implying a potential downside of -15.6% from current levels.2. AppLovinEarnings Date: Wednesday, Feb. 14\nEPS Growth Estimate: +457.1% Y-o-Y\nRevenue Growth Estimate: +32.1% Y-o-Y\nApplovin (NASDAQ:APP), a mobile app technology and marketing platform that helps developers monetize their apps, integrates AI to optimize user engagement and ad targeting.\nThis personalized approach enhances user satisfaction and boosts ad effectiveness, positioning AppLovin for substantial sales growth as it continues to leverage AI in the highly competitive mobile app ecosystem.\nThe Palo Alto, California-based tech firm is expected to deliver triple-digit profit growth when it releases its fourth-quarter update on Wednesday, February 14.\nNot surprisingly, an InvestingPro survey of analyst earnings revisions points to mounting optimism ahead of the print, with Wall Street growing increasingly optimistic on the mobile app technology company.\nThe last three EPS revisions from analysts have all been to the upward side and 13 analysts have a Buy-equivalent rating on the stock vs. six Hold-equivalent ratings and one Sell-equivalent ratings.Upcoming Earnings\nSource: InvestingPro\nWall Street sees AppLovin earning a profit of $0.75 per share, improving 457% from a loss of -$0.21 in the challenging year-ago period. If that is reality, it would mark the most profitable quarter in the company’s 12-year history.\nMeanwhile, the software maker’s revenue is expected to increase 32.1% year-over-year to $927.7 million, driven primarily by the successful roll-out of its latest AI-based advertising engine.\nDemonstrating the strength and resilience of its business, ProTips points out that AppLovin is in great financial health condition thanks to strong earnings and revenue growth prospects, combined with its attractive valuation.\nIn addition, it notes that management has been aggressively buying back shares.AppLovin Data\nSource: InvestingPro\nIndeed, the present valuation of APP stock suggests it is a bargain, as indicated by the InvestingPro model. There's a possibility of a +30.1% increase from last night’s closing price, moving it closer to its 'Fair Value' set at $57.32 per share.3. SnowflakeEarnings Date: Thursday, Feb. 29\nEPS Growth Estimate: +21.4% Y-o-Y\nRevenue Growth Estimate: +28.8% Y-o-Y\nSnowflake (NYSE:SNOW), a cloud data platform, leverages AI and machine learning to automate data processing, uncover valuable insights, and enhance decision-making.\nAs organizations increasingly adopt cloud-based solutions, Snowflake's AI-driven capabilities are expected to drive its sales growth, catering to the surging demand for scalable and efficient data management solutions.\nThe Bozeman, Montana-based data cloud company is anticipated to deliver explosive earnings and revenue growth when it reports fourth-quarter financial results on Thursday, February 29.\nEarnings estimates have been revised upward 24 times in the past three months, according to an InvestingPro survey, compared to just five downward revisions, as Wall Street grows increasingly bullish on the data warehousing specialist.Upcoming Earnings\nSource: InvestingPro\nAs per Investing.com consensus estimates, Snowflake’s earnings per share are expected to be $0.17 for the final three months of 2023, an improvement of 21.4% from EPS of $0.14 a year ago.\nRevenue is forecast to climb 28.8% year-over-year to $758.5 million, thanks to an expected increase in consumption from large enterprises for its cloud-based data warehouse software.\nIf confirmed, that would mark Snowflake’s highest quarterly sales total in its history.\nInvestingPro's ProTips paints a mostly positive picture of Snowflake, citing its pristine balance sheet and strong sales growth outlook.\nNonetheless, there are concerns about valuation as ProTips points out and worries about the stock being overvalued warrant investors' attention.\nSnowflake Data\nSource: InvestingPro\nIndeed, SNOW stock could see a decline of -9.9% from its current market value, according to InvestingPro, bringing shares closer to their ‘Fair Value’ of $185.59.4. OktaEarnings Date: Thursday, Feb. 29\nEPS Growth Estimate: +70% Y-o-Y\nRevenue Growth Estimate: +15.1% Y-o-Y\nOkta (NASDAQ:OKTA), a leader in identity and access management, is leveraging AI to enhance security protocols and streamline user authentication.\nThis AI-driven approach not only fortifies Okta's services but also positions the company to cater to the increasing demand for advanced identity management solutions.\nThe San Francisco, California-based identity-and-access management specialist is forecast to report strong double-digit profit and sales growth when it delivers fourth quarter results on Thursday, February 29.\nWall Street is extremely optimistic ahead of the Q4 update, as per an InvestingPro survey, with analysts increasing their EPS estimates 36 times in the past three months to reflect a gain of almost 250% from their initial expectations.Upcoming Earnings\nSource: InvestingPro\nOkta is forecast to earn $0.51 per share, increasing 70% from a profit of $0.30 a share in the year-ago period. If that is confirmed, it would mark the most profitable quarter in Okta’s history since going public in April 2017.\nMeanwhile, revenue is seen rising 15.1% year-over-year to $587.2 million as the company benefits from strong demand from large enterprises for its cloud-based identity and access management software.\nAs per InvestingPro's ProTips, Okta’s share profile is fairly positive, with several bullish tailwinds working in its favor, including a healthy balance sheet, strong free cash flows, and a robust profitability outlook.Okta Data\nSource: InvestingPro\nAdditionally, it is worth noting that the quantitative models in InvestingPro point to a gain of +20.1% in OKTA stock over the next 12 months, bringing shares closer to their ‘Fair Value’ price target of $101.46.5. SentinelOneEarnings Date: Wednesday, March 13\nEPS Growth Estimate: +70% Y-o-Y\nRevenue Growth Estimate: +15.1% Y-o-Y\nAs a cybersecurity innovator, SentinelOne (NYSE:S) integrates AI into its platform to deliver advanced threat detection and response capabilities.\nWith the cybersecurity landscape evolving rapidly, SentinelOne's AI-centric approach enhances its ability to provide cutting-edge solutions, fueling its anticipated sales growth.\nThe Mountain View, California-based cybersecurity firm is forecast to release its fourth quarter financial results on Wednesday, March 13 and sell-side confidence is brimming.\nIn a sign of increasing optimism, EPS estimates have seen 22 upward revisions in the past 90 days, according to InvestingPro, as it benefits from increased cybersecurity spending amid the rampant surge in cyberattacks.Upcoming Earnings\nSource: InvestingPro\nConsensus estimates call for a loss of -$0.04 per share for the fourth quarter, narrowing significantly from a loss per share of -$0.13 in the year-ago period, as the security software provider continues to make progress towards profitability.\nRevenue is expected to jump 34.3% year-over-year to $169.4 million, amid strong security spending due to the complex geopolitical environment.\nInvestingPro’s ProTips highlights several positive trends SentinelOne has working in its favor, including a healthy growth outlook and improved profitability trends.\nNevertheless, concerns loom as ProTips points out the cybersecurity company’s elevated sales valuation multiple.\nSentinelOne Data\nSource: InvestingPro\nIt is worth mentioning that SentinelOne’s shares appear to be fairly valued at the moment, as per the quantitative models in InvestingPro, which point to a potential upside of just +3.7% from their current market value.\nBe sure to check out InvestingPro to stay in sync with the market trend and what it means for your trading. As with any investment, it's crucial to research extensively before making any decisions.\nInvestingPro empowers investors to make informed decisions by providing a comprehensive analysis of undervalued stocks with the potential for significant upside in the market.\nJoin now for up to 50% off on our Pro and Pro+ subscription plans and never miss another bull market by not knowing which stocks to buy!\nClaim Your Discount Today!\nDisclosure: At the time of writing, I am long on the S&P 500, and the Nasdaq 100 via the SPDR S&P 500 ETF (SPY), and the Invesco QQQ Trust ETF (QQQ). I am also long on the Technology Select Sector SPDR ETF (NYSE:XLK).\nI regularly rebalance my portfolio of individual stocks and ETFs based on ongoing risk assessment of both the macroeconomic environment and companies' financials.\nThe views discussed in this article are solely the opinion of the author and should not be taken as investment advice."
        },
        {
            "title": "1 Stock to Buy, 1 Stock to Sell This Week: Microsoft, General Motors",
            "time": "- Jan 28, 2024",
            "content": "SBUX\n+0.21%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nGOOG\n+0.10%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nXLK\n-1.18%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nNVO\n+2.26%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nMETA\n+0.24%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nIXIC\n-0.36%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nAMD\n-1.71%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nUPS\n-0.29%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nPFE\n-0.02%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nXOM\n+0.85%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nMA\n+0.40%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nNDX\n-0.55%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nAMZN\n+0.87%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nAAPL\n-0.90%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nQCOM\n-2.43%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nGOOGL\n+0.21%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nMSFT\n-0.23%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nCVX\n+0.39%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nGM\n+0.06%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nBA\n+1.79%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nDJI\n+0.16%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nUS500\n-0.07%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nFed meeting, January jobs report, and heavyweight tech earnings will be in focus this week.\nMicrosoft (NASDAQ:MSFT) is a buy with a strong beat-and-raise quarter expected.\nGeneral Motors (NYSE:GM) is a sell amid weak profit, disappointing guidance on deck.\nLooking for more actionable trade ideas to navigate the current market volatility? Members of InvestingPro get exclusive ideas and guidance to navigate any climate. Learn More »\nU.S. stocks closed slightly lower on Friday as investors digested the latest batch of earnings and continued to assess the Federal Reserve’s rate plans for the months ahead.\nDespite Friday’s downbeat performance, all three major averages posted weekly gains. The blue-chip Dow Jones Industrial Average added 0.7%, the benchmark S&P 500 inched up 1.1%, and the tech-heavy Nasdaq Composite advanced 0.9%.Investing.com\nThe blockbuster week ahead is expected to be an eventful one filled with several market-moving events, including a key Fed monetary policy meeting, as well as a closely watched employment report and a flurry of heavyweight tech earnings.\nThe U.S. central bank is widely expected to leave interest rates unchanged on Wednesday, but Fed Chair Jerome Powell could offer hints about when rate cuts might start when he speaks in the post-meeting press conference.\nInvesting.com\nInvestors have largely pushed back expectations for the Fed’s first cut from March to May following a recent batch of strong economic data, as per the Investing.com Fed Rate Monitor Tool.\nBesides the Fed, most important on the economic calendar will be Friday’s U.S. employment report for January, which is forecast to show the economy added 177,000 positions, compared to jobs growth of 216,000 in December. The unemployment rate is seen holding steady at 3.7%.\nMeanwhile, the earnings season hits full swing, with five of the massive ‘Magnificent Seven’ tech stocks set to report their latest results. Microsoft, and Google-parent Alphabet (NASDAQ:GOOGL) report on Tuesday night, while Apple (NASDAQ:AAPL), Amazon (NASDAQ:AMZN), and Meta Platforms (NASDAQ:META) are due late Thursday.\nThese mega-caps will be joined by big names like Advanced Micro Devices (NASDAQ:AMD), Qualcomm (NASDAQ:QCOM), Boeing (NYSE:BA), United Parcel Service (NYSE:UPS), General Motors, ExxonMobil (NYSE:XOM), Chevron (NYSE:CVX), Mastercard (NYSE:MA), Starbucks (NASDAQ:SBUX), Pfizer (NYSE:PFE), and Novo Nordisk (NYSE:NVO).\nRegardless of which direction the market goes, below I highlight one stock likely to be in demand and another which could see fresh downside. Remember though, my timeframe is just for the week ahead, Monday, January 29 - Friday, February 2.Stock To Buy: MicrosoftI expect Microsoft to extend its march higher in the week ahead, with a possible breakout to a new record on the horizon, as the software-and-hardware giant gets set to deliver another quarter of double-digit profit and revenue growth.\nThe Redmond, Washington-based company is scheduled to release its fiscal second quarter update after the U.S. market closes on Tuesday at 4:05PM ET, and it is expected to shatter its sales record once again as growth prospects in cloud computing and artificial intelligence remain strong. A call with CEO Satya Nadella is set for 5:30PM ET.\nMarket participants expect a sizable swing in MSFT shares following the print, as per the options market, with a possible implied move of around 5% in either direction. Shares rose about 3.5% after the company’s last earnings report in October.\nAs could be expected, an InvestingPro survey of analyst earnings revisions points to mounting optimism ahead of the print amid broad strength in its cloud business and AI initiatives. The last seven EPS revisions from analysts have all been to the upside, while 51 out 56 analysts covering MSFT have a Buy-equivalent rating on the stock.InvestingPro\nAs seen above, Microsoft is forecast to earn $2.77 a share in fiscal Q2, surging 19.4% from EPS of $2.32 in the year-ago period, amid the positive impact of reduced operating expenses and ongoing job cuts. Meanwhile, revenue is expected to grow 16% annually to a record $61.1 billion.\nAs always, most of the focus will be on the performance of Microsoft’s Intelligent Cloud division, which includes Azure cloud services, Windows Server, SQL Server, Visual Studio, Nuance, GitHub, and Enterprise Services. The key unit is forecast to see sales growth of 17.5% to $25.3 billion.\nBut as is usually the case, it is more about guidance than results. Taking that into account, I reckon Microsoft will provide an upbeat outlook for the months ahead as it continues to benefit from its leading position in the AI space.Investing.com\nMSFT stock ended Friday’s session at $403.93, a tad below its all-time high of $407 from the previous session. With a market cap of $3 trillion, Microsoft is the most valuable company trading on the U.S. stock market, overtaking Apple.\nShares are up 7.4% so far in 2024 after scoring an annual gain of 56.8% in 2023 as the tech titan benefits from its growing involvement in the emerging AI field.\nAs ProTips points out, Microsoft is in great financial health condition, thanks to solid earnings prospects, and a robust profitability outlook. Additionally, it should be noted that the company has raised its dividend for 18 years running.Stock to Sell: General MotorsI foresee a weak performance for General Motors stock in the coming week, as the legacy automaker’s latest earnings report will probably underwhelm investors due to the negative impact of various headwinds on its business.\nGM’s update for the fourth quarter is scheduled to come out before the opening bell on Tuesday at 6:30AM ET and results are likely to take a hit from slowing consumer demand for its wide array of vehicles amid elevated interest rates and a deteriorating electric vehicle market.\nUnderscoring several near-term headwinds facing GM amid the current climate, eight out of 14 analysts surveyed by InvestingPro lowered their EPS estimates in the three months leading up to the print to reflect a drop of 26.6% from their initial profit forecasts.\nAs per the options market, traders are pricing in a move of about 5% in either direction for GM stock following the release. Notably, shares suffered their third straight negative earnings-day reaction after the company’s Q3 report in October. InvestingPro\nWall Street sees the Detroit, Michigan-based automaker earning $1.14 a share in the final three months of 2023, tumbling -46.2% from a profit of $2.12 in the year-ago period, amid rising operating and labor costs.\nRevenue is expected to drop -8.4% year-over-year to $39.5 billion, as higher interest rates and a weaker economic backdrop discourage consumers from making big-ticket purchases.\nAs such, it is my belief that CEO Mary Barra and GM executives will disappoint investors in their forward guidance for the first quarter of 2024 and strike a cautious tone amid the uncertain macroeconomic environment.Investing.com\nGM stock closed at $35.18 on Friday, earning the auto manufacturer a valuation of $48.2 billion. Shares have gotten off to a downbeat start to the new year, falling 2% thus far in January after ending 2023 with a gain of 6.8%.\nIt is worth mentioning that General Motors stock appears to be a tad overvalued, according to the quantitative models in InvestingPro. Its ‘Fair Value’ price estimate stands at $33.46, which points to a potential downside of -4.9% from the current market value.\nBe sure to check out InvestingPro to stay in sync with the market trend and what it means for your trading. As with any investment, it's crucial to research extensively before making any decisions.\nInvestingPro empowers investors to make informed decisions by providing a comprehensive analysis of undervalued stocks with the potential for significant upside in the market.\nJoin now for up to 50% off on our Pro and Pro+ subscription plans and never miss another bull market by not knowing which stocks to buy!\nDisclosure: At the time of writing, I am long on the S&P 500, and the Nasdaq 100 via the SPDR S&P 500 ETF (SPY), and the Invesco QQQ Trust ETF (QQQ). I am also long on the Technology Select Sector SPDR ETF (NYSE:XLK).\nI regularly rebalance my portfolio of individual stocks and ETFs based on ongoing risk assessment of both the macroeconomic environment and companies' financials.\nThe views discussed in this article are solely the opinion of the author and should not be taken as investment advice."
        },
        {
            "title": "Street Calls of the Week: Exxon Mobil receives rare upgrade",
            "time": "- Jan 28, 2024",
            "content": "US500\n-0.07%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nXOM\n+0.85%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nLCO\n+0.42%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nNG\n-2.21%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nSUN\n+3.19%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nCAR\n+0.45%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nAAL\n-1.50%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nBTC/USD\n-0.84%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n\n\nCOIN\n+3.46%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\n Here is your Pro Recap of the top takeaways from Wall Street analysts for the past week: upgrades for American Airlines, Exxon Mobil, Sunoco, Avis Budget, and Coinbase,\nInvestingPro subscribers always get first dibs on market-moving rating changes.American Airlines upgradedWhat happened? On Monday, Wolfe Research upgraded American Airlines Group (NASDAQ:AAL) to Outperform with a $17.00 price target.\nWhat’s the full story? Wolfe Research upgraded American Airlines to Buy, as they see 2024 as a bridge year for airlines, with EPS bottoming out and RASM turning positive. The analysts note that the Airline Index has lagged the S&P 500 for four consecutive years, and that all airline stocks underperformed last year due to rising capacity and falling pricing. Wolfe expects mixed trends in 2024 and more upside potential as capacity growth moderates.\nThe analysts also find American’s valuation attractive, as it trades at low multiples of their EPS and EBITDAR estimates for 2024 and 2025. Wolfe projects a below-Consensus EPS of $1.75 for 2024, but a recovering EPS of $2.95 for 2025.\nThe brokerage argues that American Airlines is well-positioned to benefit from the rebound in the airline industry as it has a large and loyal customer base, a diversified network, and a strong balance sheet.\nOutperform at Wolfe means “The security is projected to outperform analyst's industry coverage universe over the next 12 months.”\nHow did the stock react? American Airlines equity traded higher on the premarket headlines from $13.65 to $13.90, a gain of 1.68%. American opened the regular session at $13.95 and closed at $13.61.\nnew yearnew yearExxonMobil upgradedWhat happened? On Tuesday, TD Cowen upgraded Exxon Mobil Corp (NYSE:XOM) to Outperform with a $115 price target.\nWhat’s the full story? TD Cowen is upgrading Exxon on valuation. The analysts forecast Exxon’s Free Cash Flow (FCF) to increase from $30B at strip Brent in 2024-25 to $36B at $65 Brent in 2027. The stock is valued at an average 8% FCF post-PXD share issuance, compared to their 6.5% used in the target price. For reference, Exxon traded better than 6% yield from 2017-2019. The growing cash flow and $28B balance sheet capacity should enable Exxon to sustain its $20B/yr buybacks, implying an 8.4% shareholder distribution yield.\nThe analysts value XOM on a Net Present Value (NPV) of FCF to 2027, using 2027 as a terminal year at 6.5% yield. The commodity market has just experienced two years of very strong pricing, with oil, refining margins, and global natural gas prices all well above historical levels according to the research note. TD Cowen anticipates a step lower in these commodity prices moving forward.\nExxon has been investing in low-cost projects, improving downstream competitiveness, and taking cost out of its business, driving down the oil price needed to organically cover its dividend. XOM guides to a $40/bbl dividend breakeven that it anticipates will continue to move lower to $35, with peers averaging over $50.\nOutperform at TD Cowen means “The stock is expected to achieve a total positive return of at least 15% over the next 12 months.”\nHow did the stock react? XOM equity traded higher on the premarket headlines from $96.96 to $97.60, a gain of 0.55%. Exxon opened the regular session at $96.80 and closed at $97.91, a gain of 1.13% since Monday’s close.Sunoco LP upgradedWhat happened? On Wednesday, Citi upgraded Sunoco LP (NYSE:SUN) to Buy with a $65 price target.\nWhat’s the full story? Citi upgraded SUN citing several cash flow enhancing transactions. The analysts highlighted the NS acquisition as a game-changer for SUN, as it diversifies its cash flows, improves its credit and liquidity, and expands its investment opportunities. The analysts also praised the financial benefits of the deal, such as the conservative synergies and the accretion potential.\nCiti projected that SUN will double its distribution growth to a 4% CAGR and generate more than $0.2 billion in excess free cash flow after reaching its leverage target in mid-2025.\nThe analysts also noted that SUN’s valuation is attractive, as it trades at less than 8.0x 2026 EBITDA when synergies are realized.\nBuy at Citi means “Buy (1) ETR of 15% or more or 25% or more for High risk stocks.”\nHow did the stock react? Sunoco opened the regular session at $57.38 and closed at $540.84 , a loss of 1.86% during Wednesday’s regular session.Avis Budget upgradedWhat happened? On Thursday, Deutsche Bank upgraded Avis Budget Group Inc (NASDAQ:CAR) to Buy with a $248 price target\nWhat’s the full story? Deutsche Bank has upgraded Avis to Buy, as they believe that the weakness in Avis is partly due to the downward revisions in Hertz’s estimates, which are driven by depreciation rates and RPD (revenue per day). The analysts argue that Avis has important differences from Hertz, such as lower EV (electric vehicle) exposure, straight line depreciation, and steady ICE (internal combustion engine) pricing.\nThe analysts are expecting Avis to report strong 4Q23 earnings on February 12, and to clarify that the issues affecting Hertz are not affecting Avis. They think that this will be a clear and meaningful catalyst for Avis, as the market realizes that Avis is better positioned than Hertz in the rental car industry.\nBuy at Deutsche Banks means “We take a neutral view on the stock 12-months out and, based on this time horizon, do not recommend either a Buy or Sell. “\nHow did the stock react? CAR equity jumped up on the premarket headlines, from $166.90 to $170.55. Avis Budget opened the regular session at $173.81 and closed at $173.41, a gain of 3.90% since Wednesday’s close.Coinbase upgradedWhat happened? On Friday, Oppenheimer upgraded Coinbase Global Inc (NASDAQ:COIN) to Outperform with a $160 price target.\nWhat’s the full story? Oppenheimer boosted their recommendation on COIN to Buy, citing on their thesis that COIN will either win or dismiss the SEC lawsuit, that the Spot Bitcoin ETF is a positive development, that COIN’s fundamentals are improving, that COIN has positive GAAP EPS prospects, and that COIN has multiple catalysts in the near and long term. The analysts see a favorable risk/reward trade-off, as COIN has fallen 35% since Dec 28.\nThe analysts also praised COIN’s resilience and strength during the “crypto winter”, when many of its peers collapsed. Oppenheimer asserts that COIN continues fighting for its business and the industry, and that the company and its management are stronger and tougher than most people think.\nOutperform at Oppenheimer means “Stock expected to outperform the S&P 500 within the next 12-18 months.”\nHow did the stock react? COIN equity traded up on the premarket headlines from $120.50 to $124.96. Coinbase opened the regular session at $127.16 and closed at $124.76, a gain of 3.10% since Thursday’s close.\nnew yearnew year"
        },
        {
            "title": "Intel Nosedives 10%+ Despite EPS Beat: Tipping Point or Buying...",
            "time": "- Jan 26, 2024",
            "content": "INTC\n-11.91%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nIntel's fourth-quarter earnings led to a more than 10% premarket dip in its stock, despite beating estimates.\nWhile the report offered some respite after a period of disappointment, the Q1 outlook fell below expectations, sparking concerns about the company's path to recovery.\nInvesting Pro's Fair Value aligns with the market reaction, signaling a bearish trend ahead.\nIn 2024, invest like the big funds from the comfort of your home with our AI-powered ProPicks stock selection tool. Learn more here>>\nIntel (NASDAQ:INTC) stock experienced a more than 10% decline in premarket trade on Friday following the chipmaker's fourth-quarter earnings, which exceeded estimates but presented an outlook for the current quarter that fell below expectations.\nAfter a steady period of earnings disappointment, yesterday's report was meant to give investors some respite.\nLast Reported Earnings\nSource: InvestingPro\nAdjusted EPS was $0.54, compared to the $0.45 estimate while adjusted revenues were $15.406 billion, beating the $15.170 billion estimate and more than $300 million above the October guidance.\nMany anticipated that the company would release results that would disappoint the market, reinforcing the pessimistic sentiment surrounding the chip manufacturer\nThis occurred in both the second and third quarters, surpassing conservative earnings estimates by returning to profitability ahead of schedule and offering an optimistic outlook for the future.\nConsequently, the stock experienced a significant rally over the past year, doubling in value and instilling hope among many investors. Intel 2023 Performance\nDespite the hint of a return to its best, Intel remains far from its heyday when it generated quarterly sales of more than $20 billion in 2021 alone.\nBreaking it down, Client Computing (the PC chip business) reported sales of $8.84 billion, surpassing the estimated $8.42 billion, while data center and artificial intelligence revenue amounted to $4.0 billion, falling short of the projection of $4.08 billion.\nFurthermore, Network & Edge billed $1.47 billion, missing estimates of $1.55 billion, while Mobileye billed $637 million, exceeding the estimated $627.2 million.\nFinally, Intel Foundry Services billed $291 million, also falling short of estimates by $342.5 million.\nThe adjusted operating profit was $2.58 billion, surpassing the estimated $2.1 billion, and the adjusted operating margin reached 16.7 percent, beating estimates by 13.9 percent.\nHowever, R&D expenses were $3.99 billion, slightly exceeding estimates of $3.9 billion.\nLooking forward, what raises concerns is that Intel continues to experience a downward trend in key financials.\nRevenues are projected to be in the range of $14.5 billion to $15.1 billion, with a gross margin of 44.5% (estimates of 45.5% and down from current estimates), resulting in an EPS of $0.45. Upcoming Earnings\nSource: InvestingPro\nThe outlook suggests that Intel still has a long way to go before it can restore and return to past levels, even judging by the market reaction. INTC Pre Market\nInvesting Pro's Fair Value confirms the bearish trend in the coming months and the current overvaluation of the stock.\nFair Value\nSource: InvestingPro\n***Take your investing game to the next level in 2024 with ProPicksInstitutions and billionaire investors worldwide are already well ahead of the game when it comes to AI-powered investing, extensively using, customizing, and developing it to bulk up their returns and minimize losses.Now, InvestingPro users can do just the same from the comfort of their own homes with our new flagship AI-powered stock-picking tool: ProPicks.With our six strategies, including the flagship \"Tech Titans,\" which outperformed the market by a lofty 952% over the last decade, investors have the best selection of stocks in the market at the tip of their fingers every month.Subscribe here for up to 50% off as part of our year-end sale and never miss a bull market again!Claim Your Discount Today!Disclaimer: This article is written for informational purposes only; it does not constitute a solicitation, offer, advice, or recommendation to invest as such it is not intended to incentivize the purchase of assets in any way. I would like to remind you that any type of asset, is evaluated from multiple points of view and is highly risky and therefore, any investment decision and the associated risk remains with the investor."
        },
        {
            "title": "Bitcoin Bulls Hopeful Ahead of Potential Trend Reversal: Key Levels to...",
            "time": "- Jan 26, 2024",
            "content": "BTC/USD\n-0.84%\n\n\n\n\n\nAdd to/Remove from Watchlist\n\n\n\n\n\n\n\n\n\nAdd to Watchlist \n\nAdd Position \n\n\n\nPosition added successfully to: \n\n\n\n\n\n\n\n\n\n\nPlease name your holdings portfolio\n\n\n\n\nType:\n\nBUY\nSELL\n\n\n\nDate:\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nAmount:\n\n\n\nPrice\n\n\n\nPoint Value:\n\n\n\n\n\n\nLeverage:\n\n1:1\n1:10\n1:25\n1:50\n1:100\n1:200\n1:400\n1:500\n1:1000\n\n\n\nCommission:\n\n\n\n\n\n\n\n\n\n \n\nCreate New Watchlist\nCreate \n\n\nCreate a new holdings portfolio\nAdd\nCreate \n\n+ Add another position\nClose \n\n\n\n\n\n \n\n\n\nThis week, Bitcoin's technicals have signaled a potential shift in its recent downtrend.\nThe crypto found support around $39,500, raising hopes that the correction is ending.\nPotential trend reversal also hinges on ETF developments, Grayscale's GBTC, and global risk appetite, setting the stage for a pivotal next week.\nIn 2024, invest like the big funds from the comfort of your home with our AI-powered ProPicks stock selection tool. Learn more here>>\nThis week, Bitcoin traded along a downward-sloping support line, extending its gradual decline that began in early January.\nThis shift occurred as the cryptocurrency, experiencing nearly a 5% drop on the first day of the week, broke the downward trend after losing crucial support around the 41,000 area.\nThe support stabilized around $39,500 during a week marked by increased losses, instilling hope that the correction might have come to an end.\nExamining the technical aspects, clear indicators are pointing to this region as a robust support point.\nNotably, the 3-month EMA at $39,800 is considered a critical dynamic support for Bitcoin, historically triggering meaningful reactions.\nFurthermore, the Fibonacci levels derived from the October-December surge remain relevant, with a support line first forming around Fib 0.236 during the correction, followed by a support line at Fib 0.382 at the breakout.\nBTC/USD Price Chart\nThe support line formed by the convergence of the Stochastic RSI, which rebounded from the oversold zone following the ETF approval on January 11, indicates a potential recovery.\nPurchases at this support level could signal an impending upward movement. However, decisive resistance levels stand ahead for Bitcoin's trend reversal.\nMonitoring the daily chart, we'll track the 8- and 21-day EMAs at $40,670 and $41,800 as dynamic resistances.\nA breakthrough above these short-term averages, followed by a clear daily close beyond $42,500, would serve as a recovery trigger, suggesting the technical end of selling pressure.\nThe sustainability of potential upward momentum in Bitcoin hinges on positive developments, with ETF news playing a pivotal role.\nEasing pressure on Grayscale's GBTC redemptions has boosted market morale, but attention is on potential changes in Grayscale's fee policy, as highlighted in JPMorgan's recent report.\nThe global increase in risk appetite holds significant importance for Bitcoin and the interconnected crypto markets.\nNext week's focus on the US economy and the Fed's interest rate decision will be critical.\nThe markets anticipate the Fed to maintain current rates, but clues regarding potential rate cuts will be closely watched, influencing both traditional and Bitcoin markets.\nShould Bitcoin maintain its support around $39,500 until the interest rate decision, it could create an opportune environment for recovery amid potential dovish comments.\nIn such a scenario, a decisive break above $42,500, reaching resistance at $44,300, might initiate momentum toward the $50,000 region.\nOn the downside, if Bitcoin fails to recover from the downward trend and dips below the 3-month EMA, it could potentially retreat to the $34,800 - $37,000 range.\n***Take your investing game to the next level in 2024 with ProPicksInstitutions and billionaire investors worldwide are already well ahead of the game when it comes to AI-powered investing, extensively using, customizing, and developing it to bulk up their returns and minimize losses.Now, InvestingPro users can do just the same from the comfort of their own homes with our new flagship AI-powered stock-picking tool: ProPicks.With our six strategies, including the flagship \"Tech Titans,\" which outperformed the market by a lofty 952% over the last decade, investors have the best selection of stocks in the market at the tip of their fingers every month.Subscribe here for up to 50% off as part of our year-end sale and never miss a bull market again!Claim Your Discount Today!Disclaimer: This article is written for informational purposes only; it does not constitute a solicitation, offer, advice, or recommendation to invest as such it is not intended to incentivize the purchase of assets in any way. I would like to remind you that any type of asset, is evaluated from multiple points of view and is highly risky and therefore, any investment decision and the associated risk remains with the investor."
        }
    ]
}